[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:11:53
 import { call, put, takeEvery, takeLatest } from 'redux-saga/effects';
 import { StorageService } from '.';
 
-export function getStorageService(): StorageService {
-    return StorageService.create();
-}
+export function getStorageService(): StorageService {}
 
 export function* loadStateSaga() {
killedBy: loadStateSaga dispatches REPLACE_STATE after storage.loadState returned
statusReason: TypeError: Cannot read property 'loadState' of undefined

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:15:34
     return StorageService.create();
 }
 
-export function* loadStateSaga() {
-    try {
-        const storageService: StorageService = yield call(getStorageService);
-        const state: AppState = yield call(storageService.loadState);
-        yield put(replaceState(state));
-    } catch (e) {
-        yield put(ioError('loadStateSaga'));
-    }
-}
+export function* loadStateSaga() {}
 
 export function* saveStateSaga(action: SaveStateAction) {
killedBy: loadStateSaga dispatches REPLACE_STATE after storage.loadState returned
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:16:9
 }
 
 export function* loadStateSaga() {
-    try {
-        const storageService: StorageService = yield call(getStorageService);
-        const state: AppState = yield call(storageService.loadState);
-        yield put(replaceState(state));
-    } catch (e) {
+    try {} catch (e) {
         yield put(ioError('loadStateSaga'));
     }
killedBy: loadStateSaga dispatches REPLACE_STATE after storage.loadState returned
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:20:17
         const storageService: StorageService = yield call(getStorageService);
         const state: AppState = yield call(storageService.loadState);
         yield put(replaceState(state));
-    } catch (e) {
-        yield put(ioError('loadStateSaga'));
-    }
+    } catch (e) {}
 }
 
killedBy: loadStateSaga dispatches IO_ERROR on storageService.loadState exception
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:25:57
     }
 }
 
-export function* saveStateSaga(action: SaveStateAction) {
-    try {
-        const state = action.payload.state;
-        const storageService: StorageService = yield call(getStorageService);
-        yield call(storageService.saveState, state);
-    } catch (e) {
-        yield put(ioError('saveStateSaga'));
-    }
-}
+export function* saveStateSaga(action: SaveStateAction) {}
 
 export function* watchLoadStateSaga() {
killedBy: saveStateSaga calls storageService.saveState
statusReason: SagaTestError: 
call expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:26:9
 }
 
 export function* saveStateSaga(action: SaveStateAction) {
-    try {
-        const state = action.payload.state;
-        const storageService: StorageService = yield call(getStorageService);
-        yield call(storageService.saveState, state);
-    } catch (e) {
+    try {} catch (e) {
         yield put(ioError('saveStateSaga'));
     }
killedBy: saveStateSaga calls storageService.saveState
statusReason: SagaTestError: 
call expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:30:17
         const state = action.payload.state;
         const storageService: StorageService = yield call(getStorageService);
         yield call(storageService.saveState, state);
-    } catch (e) {
-        yield put(ioError('saveStateSaga'));
-    }
+    } catch (e) {}
 }
 
killedBy: saveStateSaga dispatches IO_ERROR on storageService.saveState exception
statusReason: SagaTestError: 
put expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,

[Survived] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:35:39
     }
 }
 
-export function* watchLoadStateSaga() {
-    yield takeEvery(AppActions.LOAD_STATE, loadStateSaga);
-}
+export function* watchLoadStateSaga() {}
 
 export function* watchSaveStateSaga() {

[Survived] BlockStatement
game-of-life/src/StorageService/StorageService.saga.ts:39:39
     yield takeEvery(AppActions.LOAD_STATE, loadStateSaga);
 }
 
-export function* watchSaveStateSaga() {
-    yield takeLatest(AppActions.SAVE_STATE, saveStateSaga);
-}
+export function* watchSaveStateSaga() {}
 
