[Killed] BlockStatement
src/components/AuthorizedHead/AuthorizedHead.tsx:14:99
     onLogout: () => void;
     counter: number;
 }
-export const AuthorizedHead: React.FC<AuthorizedHeadProps> = ({ userName, onLogout, counter }) => {
-    return (
-        <TableBg>
-            <TopControls>
-                <section className={cn(styles.topBox, styles.frame)}>
-                    <h1 className={styles.h1}>Game of life</h1>
-                    <article>
-                        <div className={styles.loggedInUser}>
-                            <label className={styles.label}>{userName} </label>
-                            <Button onClick={onLogout}>Logout</Button>
-                        </div>
-                    </article>
-                    <article className={styles.counterArticle}>
-                        <p>Generation:</p>
-                        <p className={styles.counter}>{counter}</p>
-                    </article>
-                </section>
-            </TopControls>
-        </TableBg>
-    );
-};
+export const AuthorizedHead: React.FC<AuthorizedHeadProps> = ({ userName, onLogout, counter }) => {};
 
 // const TopBox = styled.section`
killedBy: AuthorizedHead renders without class "disabled" if props.disabled!=true
statusReason: Error: AuthorizedHead(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
