[Survived] BooleanLiteral
src/components/LoginForm/LoginForm.tsx:12:52
 }
 export const LoginForm: React.FC<LoginFormProps> = ({ onChangeName }) => {
     const [val, setVal] = React.useState('');
-    const [disabled, setDisabled] = React.useState(false);
+    const [disabled, setDisabled] = React.useState(true);
     const onSubmit = (e: React.FormEvent) => {
         e.preventDefault();

[Killed] BlockStatement
src/components/LoginForm/LoginForm.tsx:13:46
 export const LoginForm: React.FC<LoginFormProps> = ({ onChangeName }) => {
     const [val, setVal] = React.useState('');
     const [disabled, setDisabled] = React.useState(false);
-    const onSubmit = (e: React.FormEvent) => {
-        e.preventDefault();
-        onChangeName(val.trim());
-    };
+    const onSubmit = (e: React.FormEvent) => {};
 
     const myOnChange = (evt: { target: { value: React.SetStateAction<string> } }) => {
killedBy: LoginForm calls onName() callback when submit is clicked and name is not empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/components/LoginForm/LoginForm.tsx:18:86
         onChangeName(val.trim());
     };
 
-    const myOnChange = (evt: { target: { value: React.SetStateAction<string> } }) => {
-        setVal(evt.target.value);
-    };
+    const myOnChange = (evt: { target: { value: React.SetStateAction<string> } }) => {};
 
     React.useEffect(() => {
killedBy: LoginForm calls onName() callback when submit is clicked and name is not empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/components/LoginForm/LoginForm.tsx:22:27
         setVal(evt.target.value);
     };
 
-    React.useEffect(() => {
-        setDisabled(val.trim() === '');
-    });
+    React.useEffect(() => {});
 
     return (
killedBy: LoginForm dos not call props.onName() callback when submit is clicked and name consists of spaces
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ""

[Killed] ConditionalExpression
src/components/LoginForm/LoginForm.tsx:23:21
     };
 
     React.useEffect(() => {
-        setDisabled(val.trim() === '');
+        setDisabled(false);
     });
 
killedBy: LoginForm dos not call props.onName() callback when submit is clicked and name consists of spaces
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ""

[Killed] EqualityOperator
src/components/LoginForm/LoginForm.tsx:23:21
     };
 
     React.useEffect(() => {
-        setDisabled(val.trim() === '');
+        setDisabled(val.trim() !== '');
     });
 
killedBy: LoginForm calls onName() callback when submit is clicked and name is not empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] StringLiteral
src/components/LoginForm/LoginForm.tsx:53:27
     );
 };
 
-const Label = styled.label`
-    color: ${CAPTION_COLOR};
-    font-size: 14px;
-`;
+const Label = styled.label``;
 
 const Form = styled.form`
