[Killed] ArrowFunction
game-of-life/src/StorageService/StorageService.thunk.ts:6:31
 import { store } from '@src/store/store';
 
 export type AppDispatch = typeof store.dispatch;
-export const loadStateThunk = (storage: StorageService) => (dispatch: AppDispatch) => {
-    return storage.loadState().then((st: AppState) => {
-        dispatch(replaceState(st));
-    });
-};
+export const loadStateThunk = () => undefined;
 
 export const saveStateThunk = (storage: StorageService, st: AppState) => () => {
killedBy: loadStateThunk() calls dispatch() if storage.loadState resolves
statusReason: TypeError: thunkAction is not a function

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.thunk.ts:6:87
 import { store } from '@src/store/store';
 
 export type AppDispatch = typeof store.dispatch;
-export const loadStateThunk = (storage: StorageService) => (dispatch: AppDispatch) => {
-    return storage.loadState().then((st: AppState) => {
-        dispatch(replaceState(st));
-    });
-};
+export const loadStateThunk = (storage: StorageService) => (dispatch: AppDispatch) => {};
 
 export const saveStateThunk = (storage: StorageService, st: AppState) => () => {
killedBy: loadStateThunk() calls dispatch() if storage.loadState resolves
statusReason: TypeError: Cannot read property 'then' of undefined

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.thunk.ts:7:55
 
 export type AppDispatch = typeof store.dispatch;
 export const loadStateThunk = (storage: StorageService) => (dispatch: AppDispatch) => {
-    return storage.loadState().then((st: AppState) => {
-        dispatch(replaceState(st));
-    });
+    return storage.loadState().then((st: AppState) => {});
 };
 
killedBy: loadStateThunk() calls dispatch() if storage.loadState resolves
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
game-of-life/src/StorageService/StorageService.thunk.ts:12:31
     });
 };
 
-export const saveStateThunk = (storage: StorageService, st: AppState) => () => {
-    return storage.saveState(st);
-};
+export const saveStateThunk = () => undefined;
 
killedBy: saveStateThunk() calls storage.saveState()
statusReason: TypeError: thunkAction is not a function

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.thunk.ts:12:80
     });
 };
 
-export const saveStateThunk = (storage: StorageService, st: AppState) => () => {
-    return storage.saveState(st);
-};
+export const saveStateThunk = (storage: StorageService, st: AppState) => () => {};
 
killedBy: saveStateThunk() calls storage.saveState()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
