[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:4:31
 import { AppState } from '@src/store/ducks/game';
 
 export class StorageService {
-    setState(state: AppState) {
-        localStorage.setItem('state', JSON.stringify(state));
-    }
+    setState(state: AppState) {}
 
     getState = (): AppState | null => {
killedBy: MyStorage .setState(state) writes state to localStorage.state
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] StringLiteral
game-of-life/src/StorageService/StorageService.ts:5:30
 
 export class StorageService {
     setState(state: AppState) {
-        localStorage.setItem('state', JSON.stringify(state));
+        localStorage.setItem("", JSON.stringify(state));
     }
 
killedBy: MyStorage .setState(state) writes state to localStorage.state
statusReason: SyntaxError: Unexpected token u in JSON at position 0

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:8:39
         localStorage.setItem('state', JSON.stringify(state));
     }
 
-    getState = (): AppState | null => {
-        if (localStorage.getItem('state')) {
-            try {
-                const state = JSON.parse(localStorage.getItem('state') as string);
-                return state;
-            } catch (e) {
-                return null;
-            }
-        }
-        return null;
-    };
+    getState = (): AppState | null => {};
 
     loadState = (): Promise<AppState> => {
killedBy: MyStorage .getState returns null if localStorage.state == ""
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: null
Received: undefined

[Killed] ConditionalExpression
game-of-life/src/StorageService/StorageService.ts:9:13
     }
 
     getState = (): AppState | null => {
-        if (localStorage.getItem('state')) {
+        if (false) {
             try {
                 const state = JSON.parse(localStorage.getItem('state') as string);
killedBy: MyStorage .getState returns localStorage.name if localStorage.state != ""
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"counter": 0, "data": [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0], "errorInfo": "", "event": "g-o-l/game/DEFAULT", "fieldHeight": 5, "fieldWidth": 5, "fillPercent": "P25", "mode": "PAUSE", "size": "SMALL", "speed": "SLOW", "userName": "bypassing"}
Received: null

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:9:44
     }
 
     getState = (): AppState | null => {
-        if (localStorage.getItem('state')) {
-            try {
-                const state = JSON.parse(localStorage.getItem('state') as string);
-                return state;
-            } catch (e) {
-                return null;
-            }
-        }
+        if (localStorage.getItem('state')) {}
         return null;
     };
killedBy: MyStorage .getState returns localStorage.name if localStorage.state != ""
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: null

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:10:17
 
     getState = (): AppState | null => {
         if (localStorage.getItem('state')) {
-            try {
-                const state = JSON.parse(localStorage.getItem('state') as string);
-                return state;
-            } catch (e) {
+            try {} catch (e) {
                 return null;
             }
killedBy: MyStorage .getState returns localStorage.name if localStorage.state != ""
statusReason: Error: expect(received).toEqual(expected) // deep equality

Received: null

[Survived] BlockStatement
game-of-life/src/StorageService/StorageService.ts:13:25
             try {
                 const state = JSON.parse(localStorage.getItem('state') as string);
                 return state;
-            } catch (e) {
-                return null;
-            }
+            } catch (e) {}
         }
         return null;

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:20:42
         return null;
     };
 
-    loadState = (): Promise<AppState> => {
-        return new Promise((resolve, reject) => {
-            const st = this.getState();
-            if (st !== null) {
-                resolve(st);
-            } else {
-                reject(st);
-            }
-        });
-    };
+    loadState = (): Promise<AppState> => {};
 
     saveState = (state: AppState): Promise<void> => {
killedBy: MyStorage .loadState rejects if state is empty
statusReason: Error: expect(received).rejects.toBe()

Matcher error: received value must be a promise or a function returning a promise

Received has value: undefined

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:21:49
     };
 
     loadState = (): Promise<AppState> => {
-        return new Promise((resolve, reject) => {
-            const st = this.getState();
-            if (st !== null) {
-                resolve(st);
-            } else {
-                reject(st);
-            }
-        });
+        return new Promise((resolve, reject) => {});
     };
 
killedBy: MyStorage .loadState rejects if state is empty
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Killed] EqualityOperator
game-of-life/src/StorageService/StorageService.ts:23:17
     loadState = (): Promise<AppState> => {
         return new Promise((resolve, reject) => {
             const st = this.getState();
-            if (st !== null) {
+            if (st === null) {
                 resolve(st);
             } else {
killedBy: MyStorage .loadState rejects if state is empty
statusReason: Error: expect(received).rejects.toBe()

Received promise resolved instead of rejected
Resolved to value: null

[Killed] ConditionalExpression
game-of-life/src/StorageService/StorageService.ts:23:17
     loadState = (): Promise<AppState> => {
         return new Promise((resolve, reject) => {
             const st = this.getState();
-            if (st !== null) {
+            if (false) {
                 resolve(st);
             } else {
killedBy: MyStorage .loadState resolves if state is not empty
statusReason: Error: expect(received).resolves.toEqual()

Received promise rejected instead of resolved

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:25:20
             const st = this.getState();
             if (st !== null) {
                 resolve(st);
-            } else {
-                reject(st);
-            }
+            } else {}
         });
     };
killedBy: MyStorage .loadState rejects if state is empty
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:31:53
         });
     };
 
-    saveState = (state: AppState): Promise<void> => {
-        return new Promise((resolve) => {
-            localStorage.setItem('state', JSON.stringify(state));
-            resolve();
-        });
-    };
+    saveState = (state: AppState): Promise<void> => {};
 
     static create(): StorageService {
killedBy: MyStorage .saveState resolves
statusReason: Error: expect(received).resolves.toEqual()

Matcher error: received value must be a promise

Received has value: undefined

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:32:41
     };
 
     saveState = (state: AppState): Promise<void> => {
-        return new Promise((resolve) => {
-            localStorage.setItem('state', JSON.stringify(state));
-            resolve();
-        });
+        return new Promise((resolve) => {});
     };
 
killedBy: MyStorage .saveState resolves
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Use jest.setTimeout(newTimeout) to increase the timeout value, if this is a long-running test."

[Killed] BlockStatement
game-of-life/src/StorageService/StorageService.ts:38:37
         });
     };
 
-    static create(): StorageService {
-        return new StorageService();
-    }
+    static create(): StorageService {}
 }
 
killedBy: MyStorage .setState(state) writes state to localStorage.state
statusReason: TypeError: Cannot read property 'setState' of undefined
