[Killed] BlockStatement
src/components/AppStateView/AppStateView.tsx:7:76
 interface AppStateViewProps {
     appState: AppState;
 }
-export const AppStateView: React.FC<AppStateViewProps> = ({ appState }) => {
-    return (
-        <>
-            <article className="fieldSize">
-                <span className="label1">field size=</span>
-                <span className="value">
-                    [{appState.fieldWidth} x {appState.fieldHeight}]
-                </span>
-            </article>
-        </>
-    );
-};
+export const AppStateView: React.FC<AppStateViewProps> = ({ appState }) => {};
 
killedBy: AppStateView It renders field size from props.appState
statusReason: Error: AppStateView(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
