[Killed] BlockStatement
src/components/Button/Button.tsx:20:7
     onClick,
     id,
     type,
-}) => {
-    return (
-        <button
-            className={cn(styles.but, { disabled: disabled, active: active })}
-            disabled={disabled}
-            onClick={onClick}
-            id={id}
-            type={type}
-        >
-            {children}
-        </button>
-    );
-};
+}) => {};
 
killedBy: Button renders without class "disabled" if props.disabled!=true
statusReason: Error: Button(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
