[Killed] BlockStatement
src/components/Cell/Cell.tsx:14:98
     isBottom: boolean;
 }
 
-export const Cell: React.FC<CellProps> = ({ num, alive, isLeft, isRight, isBottom, ...func }) => {
-    const onClick = () => {
-        func.onClick(num);
-    };
-    return (
-        <article
-            onClick={onClick}
-            className={cn(styles.cell, {
-                [styles.show]: alive,
-                [styles.left]: isLeft,
-                [styles.right]: isRight,
-                [styles.bottom]: isBottom,
-            })}
-        >
-            <span data-testid="inner-cell" className={cn({ [styles.show]: alive })}></span>
-        </article>
-    );
-};
+export const Cell: React.FC<CellProps> = ({ num, alive, isLeft, isRight, isBottom, ...func }) => {};
 
killedBy: Cell It renders <article> using renderer cell with value=2
statusReason: Error: Cell(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
src/components/Cell/Cell.tsx:15:27
 }
 
 export const Cell: React.FC<CellProps> = ({ num, alive, isLeft, isRight, isBottom, ...func }) => {
-    const onClick = () => {
-        func.onClick(num);
-    };
+    const onClick = () => {};
     return (
         <article
killedBy: Cell OnClick callback is called when cell is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
