[Killed] BlockStatement
src/components/DefineMode/DefineMode.tsx:9:67
     setMode: (mode: Mode) => void;
     mode: Mode;
 }
-export const DefineMode: React.FC<Props> = ({ setMode, mode }) => {
-    const play = () => setMode(Mode.PLAY);
-    const pause = () => setMode(Mode.PAUSE);
-
-    return (
-        <>
-            <Button id="btPlay" onClick={play} active={mode === Mode.PLAY}>
-                play
-            </Button>
-            <Button id="btPause" onClick={pause} active={mode === Mode.PAUSE}>
-                pause
-            </Button>
-        </>
-    );
-};
+export const DefineMode: React.FC<Props> = ({ setMode, mode }) => {};
 
killedBy: DefineMode calls setMode() callback when #btPlay is clicked
statusReason: Error: DefineMode(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
src/components/DefineMode/DefineMode.tsx:10:18
     mode: Mode;
 }
 export const DefineMode: React.FC<Props> = ({ setMode, mode }) => {
-    const play = () => setMode(Mode.PLAY);
+    const play = () => undefined;
     const pause = () => setMode(Mode.PAUSE);
 
killedBy: DefineMode calls setMode() callback when #btPlay is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/components/DefineMode/DefineMode.tsx:11:19
 }
 export const DefineMode: React.FC<Props> = ({ setMode, mode }) => {
     const play = () => setMode(Mode.PLAY);
-    const pause = () => setMode(Mode.PAUSE);
+    const pause = () => undefined;
 
     return (
killedBy: DefineMode calls setMode() callback when #btPause is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] EqualityOperator
src/components/DefineMode/DefineMode.tsx:15:56
 
     return (
         <>
-            <Button id="btPlay" onClick={play} active={mode === Mode.PLAY}>
+            <Button id="btPlay" onClick={play} active={mode !== Mode.PLAY}>
                 play
             </Button>

[Survived] ConditionalExpression
src/components/DefineMode/DefineMode.tsx:15:56
 
     return (
         <>
-            <Button id="btPlay" onClick={play} active={mode === Mode.PLAY}>
+            <Button id="btPlay" onClick={play} active={false}>
                 play
             </Button>

[Survived] EqualityOperator
src/components/DefineMode/DefineMode.tsx:18:58
             <Button id="btPlay" onClick={play} active={mode === Mode.PLAY}>
                 play
             </Button>
-            <Button id="btPause" onClick={pause} active={mode === Mode.PAUSE}>
+            <Button id="btPause" onClick={pause} active={mode !== Mode.PAUSE}>
                 pause
             </Button>

[Survived] ConditionalExpression
src/components/DefineMode/DefineMode.tsx:18:58
             <Button id="btPlay" onClick={play} active={mode === Mode.PLAY}>
                 play
             </Button>
-            <Button id="btPause" onClick={pause} active={mode === Mode.PAUSE}>
+            <Button id="btPause" onClick={pause} active={true}>
                 pause
             </Button>
