[Killed] BlockStatement
src/components/DefineSpeed/DefineSpeed.tsx:9:70
     speed: Speed;
     setSpeed: (speed: Speed) => void;
 }
-export const DefineSpeed: React.FC<Props> = ({ speed, setSpeed }) => {
-    const slow = () => setSpeed(Speed.SLOW);
-    const medium = () => setSpeed(Speed.MEDIUM);
-    const fast = () => setSpeed(Speed.FAST);
-    return (
-        <>
-            <Button id="btSlow" onClick={slow} active={speed === Speed.SLOW}>
-                slow
-            </Button>
-            <Button id="btMedium" onClick={medium} active={speed === Speed.MEDIUM}>
-                medium
-            </Button>
-            <Button id="btFast" onClick={fast} active={speed === Speed.FAST}>
-                fast
-            </Button>
-        </>
-    );
-};
+export const DefineSpeed: React.FC<Props> = ({ speed, setSpeed }) => {};
 
killedBy: DefineSpeed calls setSpeed() callback when #btSlow is clicked
statusReason: Error: DefineSpeed(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
src/components/DefineSpeed/DefineSpeed.tsx:10:18
     setSpeed: (speed: Speed) => void;
 }
 export const DefineSpeed: React.FC<Props> = ({ speed, setSpeed }) => {
-    const slow = () => setSpeed(Speed.SLOW);
+    const slow = () => undefined;
     const medium = () => setSpeed(Speed.MEDIUM);
     const fast = () => setSpeed(Speed.FAST);
killedBy: DefineSpeed calls setSpeed() callback when #btSlow is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/components/DefineSpeed/DefineSpeed.tsx:11:20
 }
 export const DefineSpeed: React.FC<Props> = ({ speed, setSpeed }) => {
     const slow = () => setSpeed(Speed.SLOW);
-    const medium = () => setSpeed(Speed.MEDIUM);
+    const medium = () => undefined;
     const fast = () => setSpeed(Speed.FAST);
     return (
killedBy: DefineSpeed calls setSpeed() callback when #btMedium is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/components/DefineSpeed/DefineSpeed.tsx:12:18
 export const DefineSpeed: React.FC<Props> = ({ speed, setSpeed }) => {
     const slow = () => setSpeed(Speed.SLOW);
     const medium = () => setSpeed(Speed.MEDIUM);
-    const fast = () => setSpeed(Speed.FAST);
+    const fast = () => undefined;
     return (
         <>
killedBy: DefineSpeed calls setSpeed() callback when #btFast is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ConditionalExpression
src/components/DefineSpeed/DefineSpeed.tsx:15:56
     const fast = () => setSpeed(Speed.FAST);
     return (
         <>
-            <Button id="btSlow" onClick={slow} active={speed === Speed.SLOW}>
+            <Button id="btSlow" onClick={slow} active={false}>
                 slow
             </Button>

[Survived] EqualityOperator
src/components/DefineSpeed/DefineSpeed.tsx:15:56
     const fast = () => setSpeed(Speed.FAST);
     return (
         <>
-            <Button id="btSlow" onClick={slow} active={speed === Speed.SLOW}>
+            <Button id="btSlow" onClick={slow} active={speed !== Speed.SLOW}>
                 slow
             </Button>

[Survived] EqualityOperator
src/components/DefineSpeed/DefineSpeed.tsx:18:60
             <Button id="btSlow" onClick={slow} active={speed === Speed.SLOW}>
                 slow
             </Button>
-            <Button id="btMedium" onClick={medium} active={speed === Speed.MEDIUM}>
+            <Button id="btMedium" onClick={medium} active={speed !== Speed.MEDIUM}>
                 medium
             </Button>

[Survived] ConditionalExpression
src/components/DefineSpeed/DefineSpeed.tsx:18:60
             <Button id="btSlow" onClick={slow} active={speed === Speed.SLOW}>
                 slow
             </Button>
-            <Button id="btMedium" onClick={medium} active={speed === Speed.MEDIUM}>
+            <Button id="btMedium" onClick={medium} active={false}>
                 medium
             </Button>

[Survived] ConditionalExpression
src/components/DefineSpeed/DefineSpeed.tsx:21:56
             <Button id="btMedium" onClick={medium} active={speed === Speed.MEDIUM}>
                 medium
             </Button>
-            <Button id="btFast" onClick={fast} active={speed === Speed.FAST}>
+            <Button id="btFast" onClick={fast} active={false}>
                 fast
             </Button>

[Survived] EqualityOperator
src/components/DefineSpeed/DefineSpeed.tsx:21:56
             <Button id="btMedium" onClick={medium} active={speed === Speed.MEDIUM}>
                 medium
             </Button>
-            <Button id="btFast" onClick={fast} active={speed === Speed.FAST}>
+            <Button id="btFast" onClick={fast} active={speed !== Speed.FAST}>
                 fast
             </Button>
