[Killed] BlockStatement
src/components/FieldSize/FieldSize.tsx:10:75
     size: Size;
 }
 
-export const FieldSize: React.FC<FieldSizeProps> = ({ setSize, size }) => {
-    const setSmall = () => setSize(Size.SMALL);
-    const setMedium = () => setSize(Size.MIDDLE);
-    const setLarge = () => setSize(Size.LARGE);
-
-    return (
-        <>
-            <Button id="btSmall" onClick={setSmall} active={size === Size.SMALL}>
-                {SMALL_SIZE_CAPTION}
-            </Button>
-            <Button id="btMedium" onClick={setMedium} active={size === Size.MIDDLE}>
-                {MIDDLE_SIZE_CAPTION}
-            </Button>
-            <Button id="btLarge" onClick={setLarge} active={size === Size.LARGE}>
-                {LARGE_SIZE_CAPTION}
-            </Button>
-        </>
-    );
-};
+export const FieldSize: React.FC<FieldSizeProps> = ({ setSize, size }) => {};
 
killedBy: FieldSize calls setSize() callback when #btSmall is clicked
statusReason: Error: FieldSize(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ArrowFunction
src/components/FieldSize/FieldSize.tsx:11:22
 }
 
 export const FieldSize: React.FC<FieldSizeProps> = ({ setSize, size }) => {
-    const setSmall = () => setSize(Size.SMALL);
+    const setSmall = () => undefined;
     const setMedium = () => setSize(Size.MIDDLE);
     const setLarge = () => setSize(Size.LARGE);
killedBy: FieldSize calls setSize() callback when #btSmall is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/components/FieldSize/FieldSize.tsx:12:23
 
 export const FieldSize: React.FC<FieldSizeProps> = ({ setSize, size }) => {
     const setSmall = () => setSize(Size.SMALL);
-    const setMedium = () => setSize(Size.MIDDLE);
+    const setMedium = () => undefined;
     const setLarge = () => setSize(Size.LARGE);
 
killedBy: FieldSize calls setSize() callback when #btMedium is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/components/FieldSize/FieldSize.tsx:13:22
 export const FieldSize: React.FC<FieldSizeProps> = ({ setSize, size }) => {
     const setSmall = () => setSize(Size.SMALL);
     const setMedium = () => setSize(Size.MIDDLE);
-    const setLarge = () => setSize(Size.LARGE);
+    const setLarge = () => undefined;
 
     return (
killedBy: FieldSize calls setSize() callback when #btLarge is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ConditionalExpression
src/components/FieldSize/FieldSize.tsx:17:61
 
     return (
         <>
-            <Button id="btSmall" onClick={setSmall} active={size === Size.SMALL}>
+            <Button id="btSmall" onClick={setSmall} active={true}>
                 {SMALL_SIZE_CAPTION}
             </Button>

[Survived] EqualityOperator
src/components/FieldSize/FieldSize.tsx:17:61
 
     return (
         <>
-            <Button id="btSmall" onClick={setSmall} active={size === Size.SMALL}>
+            <Button id="btSmall" onClick={setSmall} active={size !== Size.SMALL}>
                 {SMALL_SIZE_CAPTION}
             </Button>

[Survived] EqualityOperator
src/components/FieldSize/FieldSize.tsx:20:63
             <Button id="btSmall" onClick={setSmall} active={size === Size.SMALL}>
                 {SMALL_SIZE_CAPTION}
             </Button>
-            <Button id="btMedium" onClick={setMedium} active={size === Size.MIDDLE}>
+            <Button id="btMedium" onClick={setMedium} active={size !== Size.MIDDLE}>
                 {MIDDLE_SIZE_CAPTION}
             </Button>

[Survived] ConditionalExpression
src/components/FieldSize/FieldSize.tsx:20:63
             <Button id="btSmall" onClick={setSmall} active={size === Size.SMALL}>
                 {SMALL_SIZE_CAPTION}
             </Button>
-            <Button id="btMedium" onClick={setMedium} active={size === Size.MIDDLE}>
+            <Button id="btMedium" onClick={setMedium} active={true}>
                 {MIDDLE_SIZE_CAPTION}
             </Button>

[Survived] ConditionalExpression
src/components/FieldSize/FieldSize.tsx:23:61
             <Button id="btMedium" onClick={setMedium} active={size === Size.MIDDLE}>
                 {MIDDLE_SIZE_CAPTION}
             </Button>
-            <Button id="btLarge" onClick={setLarge} active={size === Size.LARGE}>
+            <Button id="btLarge" onClick={setLarge} active={false}>
                 {LARGE_SIZE_CAPTION}
             </Button>

[Survived] ConditionalExpression
src/components/FieldSize/FieldSize.tsx:23:61
             <Button id="btMedium" onClick={setMedium} active={size === Size.MIDDLE}>
                 {MIDDLE_SIZE_CAPTION}
             </Button>
-            <Button id="btLarge" onClick={setLarge} active={size === Size.LARGE}>
+            <Button id="btLarge" onClick={setLarge} active={true}>
                 {LARGE_SIZE_CAPTION}
             </Button>
