[Killed] BlockStatement
src/components/GameField/GameField.tsx:15:36
 }
 
 export class GameField extends React.Component<GameFieldProps> {
-    onCellClick = (num: number) => {
-        this.props.onCellClick(num);
-    };
+    onCellClick = (num: number) => {};
 
     render() {
killedBy: GameField It calls onCellClick(<cell id>) callback when a cell is clicked
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ArithmeticOperator
src/components/GameField/GameField.tsx:20:29
     };
 
     render() {
-        const widthMinus1 = this.props.width - 1;
+        const widthMinus1 = this.props.width + 1;
         const heightMinus1 = Math.floor(this.props.data.length / this.props.width) - 1;
         return (

[Survived] ArithmeticOperator
src/components/GameField/GameField.tsx:21:30
 
     render() {
         const widthMinus1 = this.props.width - 1;
-        const heightMinus1 = Math.floor(this.props.data.length / this.props.width) - 1;
+        const heightMinus1 = Math.floor(this.props.data.length / this.props.width) + 1;
         return (
             <FieldContainer role="grid">

[Survived] ArithmeticOperator
src/components/GameField/GameField.tsx:21:41
 
     render() {
         const widthMinus1 = this.props.width - 1;
-        const heightMinus1 = Math.floor(this.props.data.length / this.props.width) - 1;
+        const heightMinus1 = Math.floor(this.props.data.length * this.props.width) - 1;
         return (
             <FieldContainer role="grid">

[Killed] BlockStatement
src/components/GameField/GameField.tsx:24:73
         const heightMinus1 = Math.floor(this.props.data.length / this.props.width) - 1;
         return (
             <FieldContainer role="grid">
-                {this.props.data.map((item: CellInfo, index: number) => {
-                    const y = Math.floor(index / this.props.width);
-                    const x = index % this.props.width;
-                    const isRight = x === widthMinus1;
-                    const isBottom = y === heightMinus1;
-                    const isLeft = x === 0;
-                    return (
-                        <Cell
-                            key={`${y}-${x}`}
-                            num={index}
-                            alive={item === CellInfo.alive}
-                            onClick={this.onCellClick}
-                            isLeft={isLeft}
-                            isRight={isRight}
-                            isBottom={isBottom}
-                        ></Cell>
-                    );
-                })}
+                {this.props.data.map((item: CellInfo, index: number) => {})}
                 <div style={{ clear: 'both' }}></div>
             </FieldContainer>
killedBy: GameField It renders 3 cells from data:[3 items]
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "article"
Received: "div"

[Survived] ArithmeticOperator
src/components/GameField/GameField.tsx:25:42
         return (
             <FieldContainer role="grid">
                 {this.props.data.map((item: CellInfo, index: number) => {
-                    const y = Math.floor(index / this.props.width);
+                    const y = Math.floor(index * this.props.width);
                     const x = index % this.props.width;
                     const isRight = x === widthMinus1;

[Survived] ArithmeticOperator
src/components/GameField/GameField.tsx:26:31
             <FieldContainer role="grid">
                 {this.props.data.map((item: CellInfo, index: number) => {
                     const y = Math.floor(index / this.props.width);
-                    const x = index % this.props.width;
+                    const x = index * this.props.width;
                     const isRight = x === widthMinus1;
                     const isBottom = y === heightMinus1;

[Survived] ConditionalExpression
src/components/GameField/GameField.tsx:27:37
                 {this.props.data.map((item: CellInfo, index: number) => {
                     const y = Math.floor(index / this.props.width);
                     const x = index % this.props.width;
-                    const isRight = x === widthMinus1;
+                    const isRight = true;
                     const isBottom = y === heightMinus1;
                     const isLeft = x === 0;

[Survived] ConditionalExpression
src/components/GameField/GameField.tsx:27:37
                 {this.props.data.map((item: CellInfo, index: number) => {
                     const y = Math.floor(index / this.props.width);
                     const x = index % this.props.width;
-                    const isRight = x === widthMinus1;
+                    const isRight = false;
                     const isBottom = y === heightMinus1;
                     const isLeft = x === 0;

[Survived] EqualityOperator
src/components/GameField/GameField.tsx:28:38
                     const y = Math.floor(index / this.props.width);
                     const x = index % this.props.width;
                     const isRight = x === widthMinus1;
-                    const isBottom = y === heightMinus1;
+                    const isBottom = y !== heightMinus1;
                     const isLeft = x === 0;
                     return (

[Survived] ConditionalExpression
src/components/GameField/GameField.tsx:28:38
                     const y = Math.floor(index / this.props.width);
                     const x = index % this.props.width;
                     const isRight = x === widthMinus1;
-                    const isBottom = y === heightMinus1;
+                    const isBottom = true;
                     const isLeft = x === 0;
                     return (

[Survived] EqualityOperator
src/components/GameField/GameField.tsx:29:36
                     const x = index % this.props.width;
                     const isRight = x === widthMinus1;
                     const isBottom = y === heightMinus1;
-                    const isLeft = x === 0;
+                    const isLeft = x !== 0;
                     return (
                         <Cell

[Survived] ConditionalExpression
src/components/GameField/GameField.tsx:29:36
                     const x = index % this.props.width;
                     const isRight = x === widthMinus1;
                     const isBottom = y === heightMinus1;
-                    const isLeft = x === 0;
+                    const isLeft = true;
                     return (
                         <Cell

[Survived] ConditionalExpression
src/components/GameField/GameField.tsx:34:36
                         <Cell
                             key={`${y}-${x}`}
                             num={index}
-                            alive={item === CellInfo.alive}
+                            alive={false}
                             onClick={this.onCellClick}
                             isLeft={isLeft}

[Survived] EqualityOperator
src/components/GameField/GameField.tsx:34:36
                         <Cell
                             key={`${y}-${x}`}
                             num={index}
-                            alive={item === CellInfo.alive}
+                            alive={item !== CellInfo.alive}
                             onClick={this.onCellClick}
                             isLeft={isLeft}

[Survived] StringLiteral
src/components/GameField/GameField.tsx:42:38
                         ></Cell>
                     );
                 })}
-                <div style={{ clear: 'both' }}></div>
+                <div style={{ clear: "" }}></div>
             </FieldContainer>
         );

[Survived] ObjectLiteral
src/components/GameField/GameField.tsx:42:29
                         ></Cell>
                     );
                 })}
-                <div style={{ clear: 'both' }}></div>
+                <div style={{}}></div>
             </FieldContainer>
         );

[Survived] BlockStatement
src/components/GameField/GameField.tsx:47:54
         );
     }
 
-    shouldComponentUpdate(nextProps: GameFieldProps) {
-        const result =
-            [
-                AppActions.FILL_PERCENT,
-                AppActions.FIELD_SIZE,
-                AppActions.INVERT,
-                AppActions.SAVE_STATE,
-            ].indexOf(nextProps.actionId) >= 0;
-        return result;
-    }
+    shouldComponentUpdate(nextProps: GameFieldProps) {}
 }
 

[Survived] EqualityOperator
src/components/GameField/GameField.tsx:49:13
 
     shouldComponentUpdate(nextProps: GameFieldProps) {
         const result =
-            [
-                AppActions.FILL_PERCENT,
-                AppActions.FIELD_SIZE,
-                AppActions.INVERT,
-                AppActions.SAVE_STATE,
-            ].indexOf(nextProps.actionId) >= 0;
+            [AppActions.FILL_PERCENT, AppActions.FIELD_SIZE, AppActions.INVERT, AppActions.SAVE_STATE].indexOf(nextProps.actionId) < 0;
         return result;
     }

[Survived] ConditionalExpression
src/components/GameField/GameField.tsx:49:13
 
     shouldComponentUpdate(nextProps: GameFieldProps) {
         const result =
-            [
-                AppActions.FILL_PERCENT,
-                AppActions.FIELD_SIZE,
-                AppActions.INVERT,
-                AppActions.SAVE_STATE,
-            ].indexOf(nextProps.actionId) >= 0;
+            true;
         return result;
     }

[Survived] StringLiteral
src/components/GameField/GameField.tsx:63:45
     active?: boolean;
 }
 
-export const FieldContainer = styled.section`
-    background: #fff;
-`;
+export const FieldContainer = styled.section``;
 
