[Survived] StringLiteral
src/components/GameSettings/GameSettings.tsx:55:27
     ${frameCSS}
 `;
 
-const Caption = styled.div`
-    display: block;
-    float: left;
-    font-size: 14px;
-    width: 90px;
-    line-height: 27px;
-    height: 30px;
-    text-align: right;
-    margin-right: 5px;
-    color: ${CAPTION_COLOR};
-`;
+const Caption = styled.div``;
 const Buttons = styled.div`
     display: block;

[Survived] StringLiteral
src/components/GameSettings/GameSettings.tsx:66:27
     margin-right: 5px;
     color: ${CAPTION_COLOR};
 `;
-const Buttons = styled.div`
-    display: block;
-    height: 30px;
-`;
+const Buttons = styled.div``;
 
