[Survived] BlockStatement
src/components/GameUI/GameUI.tsx:12:63
 export interface GameUIProps {
     invert: (num: number) => void;
 }
-export const GameUI: React.FC<GameUIProps> = ({ ...func }) => {
-    const { data, fieldWidth, event } = useAppState();
-
-    return (
-        <TableBg>
-            <article style={{ display: 'flex', justifyContent: 'center' }}>
-                <GameBox>
-                    <GameField
-                        data={data}
-                        onCellClick={func.invert}
-                        width={fieldWidth}
-                        actionId={event}
-                    />
-                </GameBox>
-            </article>
-        </TableBg>
-    );
-};
+export const GameUI: React.FC<GameUIProps> = ({ ...func }) => {};
 
 const GameBox = styled.section`

[Survived] StringLiteral
src/components/GameUI/GameUI.tsx:17:40
 
     return (
         <TableBg>
-            <article style={{ display: 'flex', justifyContent: 'center' }}>
+            <article style={{ display: "", justifyContent: 'center' }}>
                 <GameBox>
                     <GameField

[Survived] StringLiteral
src/components/GameUI/GameUI.tsx:31:31
     );
 };
 
-const GameBox = styled.section`
-    display: flex;
-    justify-content: center;
-    min-width: 400px;
-    ${frameCSS}
-`;
+const GameBox = styled.section``;
 
