[Killed] ArrowFunction
src/components/SetFillPercent/SetFillPercent.tsx:10:19
     curPercent: FillPercent;
 }
 export const SetFillPercent: React.FC<FieldSizeProps> = ({ fill, curPercent }) => {
-    const fill0 = () => fill(FillPercent.P0);
+    const fill0 = () => undefined;
     const fill25 = () => fill(FillPercent.P25);
     const fill50 = () => fill(FillPercent.P50);
killedBy: FlllPercent - parameterized tests calls fill() callback when 0% is clicked
statusReason: Error: expect(jest.fn()).toBeCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] ArrowFunction
src/components/SetFillPercent/SetFillPercent.tsx:11:20
 }
 export const SetFillPercent: React.FC<FieldSizeProps> = ({ fill, curPercent }) => {
     const fill0 = () => fill(FillPercent.P0);
-    const fill25 = () => fill(FillPercent.P25);
+    const fill25 = () => undefined;
     const fill50 = () => fill(FillPercent.P50);
     const fill75 = () => fill(FillPercent.P75);

[Survived] ArrowFunction
src/components/SetFillPercent/SetFillPercent.tsx:12:20
 export const SetFillPercent: React.FC<FieldSizeProps> = ({ fill, curPercent }) => {
     const fill0 = () => fill(FillPercent.P0);
     const fill25 = () => fill(FillPercent.P25);
-    const fill50 = () => fill(FillPercent.P50);
+    const fill50 = () => undefined;
     const fill75 = () => fill(FillPercent.P75);
     const fill100 = () => fill(FillPercent.P100);

[Survived] ArrowFunction
src/components/SetFillPercent/SetFillPercent.tsx:13:20
     const fill0 = () => fill(FillPercent.P0);
     const fill25 = () => fill(FillPercent.P25);
     const fill50 = () => fill(FillPercent.P50);
-    const fill75 = () => fill(FillPercent.P75);
+    const fill75 = () => undefined;
     const fill100 = () => fill(FillPercent.P100);
     return (

[Survived] ArrowFunction
src/components/SetFillPercent/SetFillPercent.tsx:14:21
     const fill25 = () => fill(FillPercent.P25);
     const fill50 = () => fill(FillPercent.P50);
     const fill75 = () => fill(FillPercent.P75);
-    const fill100 = () => fill(FillPercent.P100);
+    const fill100 = () => undefined;
     return (
         <>

[Survived] ConditionalExpression
src/components/SetFillPercent/SetFillPercent.tsx:17:58
     const fill100 = () => fill(FillPercent.P100);
     return (
         <>
-            <Button id="btFill0" onClick={fill0} active={curPercent === FillPercent.P0}>
+            <Button id="btFill0" onClick={fill0} active={true}>
                 clear
             </Button>

[Survived] EqualityOperator
src/components/SetFillPercent/SetFillPercent.tsx:17:58
     const fill100 = () => fill(FillPercent.P100);
     return (
         <>
-            <Button id="btFill0" onClick={fill0} active={curPercent === FillPercent.P0}>
+            <Button id="btFill0" onClick={fill0} active={curPercent !== FillPercent.P0}>
                 clear
             </Button>

[Survived] EqualityOperator
src/components/SetFillPercent/SetFillPercent.tsx:20:60
             <Button id="btFill0" onClick={fill0} active={curPercent === FillPercent.P0}>
                 clear
             </Button>
-            <Button id="btFill25" onClick={fill25} active={curPercent === FillPercent.P25}>
+            <Button id="btFill25" onClick={fill25} active={curPercent !== FillPercent.P25}>
                 25%
             </Button>

[Survived] ConditionalExpression
src/components/SetFillPercent/SetFillPercent.tsx:20:60
             <Button id="btFill0" onClick={fill0} active={curPercent === FillPercent.P0}>
                 clear
             </Button>
-            <Button id="btFill25" onClick={fill25} active={curPercent === FillPercent.P25}>
+            <Button id="btFill25" onClick={fill25} active={false}>
                 25%
             </Button>

[Survived] ConditionalExpression
src/components/SetFillPercent/SetFillPercent.tsx:23:60
             <Button id="btFill25" onClick={fill25} active={curPercent === FillPercent.P25}>
                 25%
             </Button>
-            <Button id="btFill50" onClick={fill50} active={curPercent === FillPercent.P50}>
+            <Button id="btFill50" onClick={fill50} active={false}>
                 50%
             </Button>

[Survived] ConditionalExpression
src/components/SetFillPercent/SetFillPercent.tsx:23:60
             <Button id="btFill25" onClick={fill25} active={curPercent === FillPercent.P25}>
                 25%
             </Button>
-            <Button id="btFill50" onClick={fill50} active={curPercent === FillPercent.P50}>
+            <Button id="btFill50" onClick={fill50} active={true}>
                 50%
             </Button>

[Survived] EqualityOperator
src/components/SetFillPercent/SetFillPercent.tsx:26:60
             <Button id="btFill50" onClick={fill50} active={curPercent === FillPercent.P50}>
                 50%
             </Button>
-            <Button id="btFill75" onClick={fill75} active={curPercent === FillPercent.P75}>
+            <Button id="btFill75" onClick={fill75} active={curPercent !== FillPercent.P75}>
                 75%
             </Button>

[Survived] ConditionalExpression
src/components/SetFillPercent/SetFillPercent.tsx:26:60
             <Button id="btFill50" onClick={fill50} active={curPercent === FillPercent.P50}>
                 50%
             </Button>
-            <Button id="btFill75" onClick={fill75} active={curPercent === FillPercent.P75}>
+            <Button id="btFill75" onClick={fill75} active={false}>
                 75%
             </Button>

[Survived] EqualityOperator
src/components/SetFillPercent/SetFillPercent.tsx:29:62
             <Button id="btFill75" onClick={fill75} active={curPercent === FillPercent.P75}>
                 75%
             </Button>
-            <Button id="btFill100" onClick={fill100} active={curPercent === FillPercent.P100}>
+            <Button id="btFill100" onClick={fill100} active={curPercent !== FillPercent.P100}>
                 100%
             </Button>

[Survived] ConditionalExpression
src/components/SetFillPercent/SetFillPercent.tsx:29:62
             <Button id="btFill75" onClick={fill75} active={curPercent === FillPercent.P75}>
                 75%
             </Button>
-            <Button id="btFill100" onClick={fill100} active={curPercent === FillPercent.P100}>
+            <Button id="btFill100" onClick={fill100} active={false}>
                 100%
             </Button>
