[Survived] StringLiteral
game-of-life/src/components/common.tsx:8:34
     justify-content: center;
 `;
 
-export const TableBg = styled.div`
-    background: #e9e2d7;
-    font-family: Arial, sans-serif;
-`;
+export const TableBg = styled.div``;
 
