[Survived] ObjectLiteral
react-2021-09/game-of-life/src/consts.ts:54:25
     [FillPercent.P100]: 1,
 };
 
-export const sizeToWH = {
-    [Size.SMALL]: { w: 5, h: 5 },
-    [Size.MIDDLE]: { w: 10, h: 10 },
-    [Size.LARGE]: { w: 20, h: 15 },
-};
+export const sizeToWH = {};
 
 export const CAPTION_COLOR = '#ddd';

[Survived] StringLiteral
react-2021-09/game-of-life/src/consts.ts:60:30
     [Size.LARGE]: { w: 20, h: 15 },
 };
 
-export const CAPTION_COLOR = '#ddd';
+export const CAPTION_COLOR = "";
 export const PANEL_BG_COLOR = '#555';
 export const PANEL_BORDER_COLOR = '#333';
