[Killed] ArrowFunction
src/modules/AppStateManager/AppStateManager.tsx:31:23
         super(props);
     }
 
-    private setSize = (size: Size) => this.props.store.dispatch(fieldSize(size));
+    private setSize = () => undefined;
     private invert = (num: number) => this.props.store.dispatch(invert(num));
     private fill = (percent: FillPercent) => this.props.store.dispatch(fillPercent(percent));
killedBy: AppStateManager parameterized tests renders field of size 10x10 on click at "medium"
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 101
Received: 26

[Killed] ArrowFunction
src/modules/AppStateManager/AppStateManager.tsx:32:22
     }
 
     private setSize = (size: Size) => this.props.store.dispatch(fieldSize(size));
-    private invert = (num: number) => this.props.store.dispatch(invert(num));
+    private invert = () => undefined;
     private fill = (percent: FillPercent) => this.props.store.dispatch(fillPercent(percent));
     private onChangeName = (name: string) => this.props.store.dispatch(user(name));
killedBy: AppStateManager inverts a cell after click
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ArrowFunction
src/modules/AppStateManager/AppStateManager.tsx:33:20
 
     private setSize = (size: Size) => this.props.store.dispatch(fieldSize(size));
     private invert = (num: number) => this.props.store.dispatch(invert(num));
-    private fill = (percent: FillPercent) => this.props.store.dispatch(fillPercent(percent));
+    private fill = () => undefined;
     private onChangeName = (name: string) => this.props.store.dispatch(user(name));
     private onLogout = () => this.props.store.dispatch(user(''));
killedBy: AppStateManager clears all cells after click at clear-button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 6

[Killed] ArrowFunction
src/modules/AppStateManager/AppStateManager.tsx:34:28
     private setSize = (size: Size) => this.props.store.dispatch(fieldSize(size));
     private invert = (num: number) => this.props.store.dispatch(invert(num));
     private fill = (percent: FillPercent) => this.props.store.dispatch(fillPercent(percent));
-    private onChangeName = (name: string) => this.props.store.dispatch(user(name));
+    private onChangeName = () => undefined;
     private onLogout = () => this.props.store.dispatch(user(''));
     private setSpeed = (speed: Speed) => this.props.store.dispatch(setSpeed(speed));
killedBy: AppStateManager parameterized tests renders field of size 5x5 on click at "small"
statusReason: TestingLibraryElementError: Unable to find an element with the text: small 5x5. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, <script />, <style />
<body>
  <div>
    <div
      class="css-14p2nur"
    >

[Killed] ArrowFunction
src/modules/AppStateManager/AppStateManager.tsx:35:24
     private invert = (num: number) => this.props.store.dispatch(invert(num));
     private fill = (percent: FillPercent) => this.props.store.dispatch(fillPercent(percent));
     private onChangeName = (name: string) => this.props.store.dispatch(user(name));
-    private onLogout = () => this.props.store.dispatch(user(''));
+    private onLogout = () => undefined;
     private setSpeed = (speed: Speed) => this.props.store.dispatch(setSpeed(speed));
 
killedBy: AppStateManager hides the grid after click at "logout"
statusReason: Error: expect(element).not.toBeInTheDocument()

[Killed] ArrowFunction
src/modules/AppStateManager/AppStateManager.tsx:36:24
     private fill = (percent: FillPercent) => this.props.store.dispatch(fillPercent(percent));
     private onChangeName = (name: string) => this.props.store.dispatch(user(name));
     private onLogout = () => this.props.store.dispatch(user(''));
-    private setSpeed = (speed: Speed) => this.props.store.dispatch(setSpeed(speed));
+    private setSpeed = () => undefined;
 
     private loadState = () => {
killedBy: AppStateManager allows to click gameSpeed-medium-button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "MEDIUM"
Received: "SLOW"

[Killed] BlockStatement
src/modules/AppStateManager/AppStateManager.tsx:38:31
     private onLogout = () => this.props.store.dispatch(user(''));
     private setSpeed = (speed: Speed) => this.props.store.dispatch(setSpeed(speed));
 
-    private loadState = () => {
-        this.props.store.dispatch(loadState() as unknown as AnyAction);
-    };
+    private loadState = () => {};
 
     private saveState = (st: AppState) => {
killedBy: AppStateManager dispatches loadState() after mount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g-o-l/game/LOAD_STATE"
Received: "g-o-l/game/DEFAULT"

[Survived] BlockStatement
src/modules/AppStateManager/AppStateManager.tsx:42:43
         this.props.store.dispatch(loadState() as unknown as AnyAction);
     };
 
-    private saveState = (st: AppState) => {
-        this.props.store.dispatch(saveState(st) as unknown as AnyAction);
-    };
+    private saveState = (st: AppState) => {};
     private mode = (m: Mode) => {
         this.props.store.dispatch(mode(m));

[Killed] BlockStatement
src/modules/AppStateManager/AppStateManager.tsx:45:33
     private saveState = (st: AppState) => {
         this.props.store.dispatch(saveState(st) as unknown as AnyAction);
     };
-    private mode = (m: Mode) => {
-        this.props.store.dispatch(mode(m));
-        this.props.store.dispatch(setCounter(0));
-    };
+    private mode = (m: Mode) => {};
 
     componentDidMount() {
killedBy: AppStateManager sets game.state.mode=Mode.PLAY after click at PLAY button
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "PLAY"
Received: "PAUSE"

[Killed] BlockStatement
src/modules/AppStateManager/AppStateManager.tsx:50:25
         this.props.store.dispatch(setCounter(0));
     };
 
-    componentDidMount() {
-        this.props.store.subscribe(this.storeChange);
-        this.loadState();
-    }
+    componentDidMount() {}
 
     storeChange = () => {
killedBy: AppStateManager dispatches loadState() after mount
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g-o-l/game/LOAD_STATE"
Received: "g-o-l/game/DEFAULT"

[Survived] BlockStatement
src/modules/AppStateManager/AppStateManager.tsx:55:25
         this.loadState();
     }
 
-    storeChange = () => {
-        const event = this.props.store.getState().game.event;
-        this.forceUpdate();
-        if (
-            ![
-                AppActions.REPLACE_STATE,
-                AppActions.DEFAULT,
-                AppActions.LOAD_STATE,
-                AppActions.SAVE_STATE,
-            ].includes(event)
-        ) {
-            this.saveState(this.props.store.getState().game);
-        }
-
-        if (event === AppActions.REPLACE_STATE) {
-            const curMode = this.props.store.getState().game.mode;
-            if (curMode === Mode.PLAY) {
-                setTimeout(() => this.mode(Mode.PLAY), 1000);
-            }
-        }
-    };
+    storeChange = () => {};
 
     render() {

[Killed] ConditionalExpression
src/modules/AppStateManager/AppStateManager.tsx:59:13
         const event = this.props.store.getState().game.event;
         this.forceUpdate();
         if (
-            ![
-                AppActions.REPLACE_STATE,
-                AppActions.DEFAULT,
-                AppActions.LOAD_STATE,
-                AppActions.SAVE_STATE,
-            ].includes(event)
+            true
         ) {
             this.saveState(this.props.store.getState().game);
killedBy: AppStateManager renders "Game of life proto"
statusReason: RangeError: Maximum call stack size exceeded

[Killed] BooleanLiteral
src/modules/AppStateManager/AppStateManager.tsx:59:13
         const event = this.props.store.getState().game.event;
         this.forceUpdate();
         if (
-            ![
-                AppActions.REPLACE_STATE,
-                AppActions.DEFAULT,
-                AppActions.LOAD_STATE,
-                AppActions.SAVE_STATE,
-            ].includes(event)
+            [AppActions.REPLACE_STATE, AppActions.DEFAULT, AppActions.LOAD_STATE, AppActions.SAVE_STATE].includes(event)
         ) {
             this.saveState(this.props.store.getState().game);
killedBy: AppStateManager renders "Game of life proto"
statusReason: RangeError: Maximum call stack size exceeded

[Survived] BlockStatement
src/modules/AppStateManager/AppStateManager.tsx:65:11
                 AppActions.LOAD_STATE,
                 AppActions.SAVE_STATE,
             ].includes(event)
-        ) {
-            this.saveState(this.props.store.getState().game);
-        }
+        ) {}
 
         if (event === AppActions.REPLACE_STATE) {

[Survived] ConditionalExpression
src/modules/AppStateManager/AppStateManager.tsx:69:13
             this.saveState(this.props.store.getState().game);
         }
 
-        if (event === AppActions.REPLACE_STATE) {
+        if (false) {
             const curMode = this.props.store.getState().game.mode;
             if (curMode === Mode.PLAY) {

[Survived] BlockStatement
src/modules/AppStateManager/AppStateManager.tsx:69:49
             this.saveState(this.props.store.getState().game);
         }
 
-        if (event === AppActions.REPLACE_STATE) {
-            const curMode = this.props.store.getState().game.mode;
-            if (curMode === Mode.PLAY) {
-                setTimeout(() => this.mode(Mode.PLAY), 1000);
-            }
-        }
+        if (event === AppActions.REPLACE_STATE) {}
     };
 

[Survived] ConditionalExpression
src/modules/AppStateManager/AppStateManager.tsx:71:17
 
         if (event === AppActions.REPLACE_STATE) {
             const curMode = this.props.store.getState().game.mode;
-            if (curMode === Mode.PLAY) {
+            if (true) {
                 setTimeout(() => this.mode(Mode.PLAY), 1000);
             }

[Survived] ConditionalExpression
src/modules/AppStateManager/AppStateManager.tsx:71:17
 
         if (event === AppActions.REPLACE_STATE) {
             const curMode = this.props.store.getState().game.mode;
-            if (curMode === Mode.PLAY) {
+            if (false) {
                 setTimeout(() => this.mode(Mode.PLAY), 1000);
             }

[Survived] ArrowFunction
src/modules/AppStateManager/AppStateManager.tsx:72:28
         if (event === AppActions.REPLACE_STATE) {
             const curMode = this.props.store.getState().game.mode;
             if (curMode === Mode.PLAY) {
-                setTimeout(() => this.mode(Mode.PLAY), 1000);
+                setTimeout(() => undefined, 1000);
             }
         }

[Killed] BlockStatement
src/modules/AppStateManager/AppStateManager.tsx:77:14
         }
     };
 
-    render() {
-        return (
-            <Provider store={this.props.store}>
-                <AppRouter
-                    invert={this.invert}
-                    setSize={this.setSize}
-                    fill={this.fill}
-                    onChangeName={this.onChangeName}
-                    onLogout={this.onLogout}
-                    setMode={this.mode}
-                    setSpeed={this.setSpeed}
-                    counter={this.props.store.getState().game.counter}
-                />
-            </Provider>
-        );
-    }
+    render() {}
 }
 
killedBy: AppStateManager renders "Game of life proto"
statusReason: Error: AppStateManager(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
