[Survived] ArrowFunction
store/ducks/game/game.saga.ts:6:24
 import { call, put, select, take } from 'redux-saga/effects';
 import { AppAction, AppActions, AppState, generation, setCounter, setMode } from './game';
 
-export const getGame = (s: RootState) => s.game;
+export const getGame = () => undefined;
 
 export const sleep = (x: number) => new Promise((r) => setTimeout(r, x));

[Survived] ArrowFunction
store/ducks/game/game.saga.ts:9:25
 export const getGame = (s: RootState) => s.game;
 
 export const sleep = (x: number) => new Promise((r) => setTimeout(r, x));
-export const modePlay = (action: AppAction) =>
-    action.type === AppActions.MODE && action.payload.mode === Mode.PLAY;
+export const modePlay = () => undefined;
 
 export function* watchPlaySaga() {

[Survived] ConditionalExpression
store/ducks/game/game.saga.ts:10:40
 
 export const sleep = (x: number) => new Promise((r) => setTimeout(r, x));
 export const modePlay = (action: AppAction) =>
-    action.type === AppActions.MODE && action.payload.mode === Mode.PLAY;
+    action.type === AppActions.MODE && true;
 
 export function* watchPlaySaga() {

[Survived] ConditionalExpression
store/ducks/game/game.saga.ts:10:5
 
 export const sleep = (x: number) => new Promise((r) => setTimeout(r, x));
 export const modePlay = (action: AppAction) =>
-    action.type === AppActions.MODE && action.payload.mode === Mode.PLAY;
+    true;
 
 export function* watchPlaySaga() {

[Survived] BlockStatement
store/ducks/game/game.saga.ts:12:34
 export const modePlay = (action: AppAction) =>
     action.type === AppActions.MODE && action.payload.mode === Mode.PLAY;
 
-export function* watchPlaySaga() {
-    while (true) {
-        yield take(modePlay);
-        yield put(setMode(Mode.PLAY));
-
-        const state: AppState = yield select(getGame);
-        if (state.mode === Mode.PLAY) {
-            yield call(timerLoopSaga);
-        }
-    }
-}
+export function* watchPlaySaga() {}
 
 export function* timerLoopSaga() {

[Survived] BooleanLiteral
store/ducks/game/game.saga.ts:13:12
     action.type === AppActions.MODE && action.payload.mode === Mode.PLAY;
 
 export function* watchPlaySaga() {
-    while (true) {
+    while (false) {
         yield take(modePlay);
         yield put(setMode(Mode.PLAY));

[Survived] EqualityOperator
store/ducks/game/game.saga.ts:18:13
         yield put(setMode(Mode.PLAY));
 
         const state: AppState = yield select(getGame);
-        if (state.mode === Mode.PLAY) {
+        if (state.mode !== Mode.PLAY) {
             yield call(timerLoopSaga);
         }

[Survived] ConditionalExpression
store/ducks/game/game.saga.ts:18:13
         yield put(setMode(Mode.PLAY));
 
         const state: AppState = yield select(getGame);
-        if (state.mode === Mode.PLAY) {
+        if (false) {
             yield call(timerLoopSaga);
         }

[Survived] BlockStatement
store/ducks/game/game.saga.ts:24:34
     }
 }
 
-export function* timerLoopSaga() {
-    let state: AppState = yield select(getGame);
-
-    while (state.mode === Mode.PLAY) {
-        yield put(setCounter(state.counter + 1));
-        yield put(generation());
-
-        const delay = speedToDelay[state.speed];
-
-        yield call(sleep, delay);
-        state = yield select(getGame);
-    }
-}
+export function* timerLoopSaga() {}
 

[Survived] BlockStatement
store/ducks/game/game.saga.ts:27:38
 export function* timerLoopSaga() {
     let state: AppState = yield select(getGame);
 
-    while (state.mode === Mode.PLAY) {
-        yield put(setCounter(state.counter + 1));
-        yield put(generation());
-
-        const delay = speedToDelay[state.speed];
-
-        yield call(sleep, delay);
-        state = yield select(getGame);
-    }
+    while (state.mode === Mode.PLAY) {}
 }
 

[Survived] EqualityOperator
store/ducks/game/game.saga.ts:27:12
 export function* timerLoopSaga() {
     let state: AppState = yield select(getGame);
 
-    while (state.mode === Mode.PLAY) {
+    while (state.mode !== Mode.PLAY) {
         yield put(setCounter(state.counter + 1));
         yield put(generation());

[Survived] ArithmeticOperator
store/ducks/game/game.saga.ts:28:30
     let state: AppState = yield select(getGame);
 
     while (state.mode === Mode.PLAY) {
-        yield put(setCounter(state.counter + 1));
+        yield put(setCounter(state.counter - 1));
         yield put(generation());
 
