[Survived] StringLiteral
store/ducks/game/game.ts:69:16
     size: Size.SMALL,
     fillPercent: DEFAULT_FILL_PERCENT,
     userName: '',
-    errorInfo: '',
+    errorInfo: "Stryker was here!",
     mode: Mode.PAUSE,
     speed: Speed.SLOW,

[Killed] ArrowFunction
store/ducks/game/game.ts:136:26
     payload: { counter: number };
 }
 
-export const fieldSize = (size: Size): FieldSizeAction => ({
-    type: AppActions.FIELD_SIZE,
-    payload: { size },
-});
+export const fieldSize = () => undefined;
 
 export const invert = (cellId: number): InvertAction => ({
killedBy: gameReducer gameReducer-parameterized sets .fieldWidth from FIELD_SIZE action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ArrowFunction
store/ducks/game/game.ts:141:23
     payload: { size },
 });
 
-export const invert = (cellId: number): InvertAction => ({
-    type: AppActions.INVERT,
-    payload: { cellId },
-});
+export const invert = () => undefined;
 
 export const fillPercent = (fillPercent: FillPercent): FillPercentAction => ({
killedBy: gameReducer gameReducer-parameterized sets .event from INVERT action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ObjectLiteral
store/ducks/game/game.ts:141:58
     payload: { size },
 });
 
-export const invert = (cellId: number): InvertAction => ({
-    type: AppActions.INVERT,
-    payload: { cellId },
-});
+export const invert = (cellId: number): InvertAction => ({});
 
 export const fillPercent = (fillPercent: FillPercent): FillPercentAction => ({
killedBy: gameReducer gameReducer-parameterized sets .event from INVERT action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/INVERT"
Received: "g-o-l/game/FIELD_SIZE"

[Killed] ArrowFunction
store/ducks/game/game.ts:146:28
     payload: { cellId },
 });
 
-export const fillPercent = (fillPercent: FillPercent): FillPercentAction => ({
-    type: AppActions.FILL_PERCENT,
-    payload: { fillPercent },
-});
+export const fillPercent = () => undefined;
 
 export const user = (userName: string): UserAction => ({
killedBy: gameReducer gameReducer-parameterized sets .fillPercent from FILL_PERCENT action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ObjectLiteral
store/ducks/game/game.ts:146:78
     payload: { cellId },
 });
 
-export const fillPercent = (fillPercent: FillPercent): FillPercentAction => ({
-    type: AppActions.FILL_PERCENT,
-    payload: { fillPercent },
-});
+export const fillPercent = (fillPercent: FillPercent): FillPercentAction => ({});
 
 export const user = (userName: string): UserAction => ({
killedBy: gameReducer gameReducer-parameterized sets .fillPercent from FILL_PERCENT action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/FILL_PERCENT"
Received: "g-o-l/game/DEFAULT"

[Killed] ArrowFunction
store/ducks/game/game.ts:151:21
     payload: { fillPercent },
 });
 
-export const user = (userName: string): UserAction => ({
-    type: AppActions.USER,
-    payload: { userName },
-});
+export const user = () => undefined;
 
 export const replaceState = (state: AppState): AppStateAction => ({
killedBy: gameReducer gameReducer-parameterized sets .userName from USER action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ObjectLiteral
store/ducks/game/game.ts:151:56
     payload: { fillPercent },
 });
 
-export const user = (userName: string): UserAction => ({
-    type: AppActions.USER,
-    payload: { userName },
-});
+export const user = (userName: string): UserAction => ({});
 
 export const replaceState = (state: AppState): AppStateAction => ({
killedBy: gameReducer gameReducer-parameterized sets .userName from USER action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/USER"
Received: "g-o-l/game/DEFAULT"

[Killed] ArrowFunction
store/ducks/game/game.ts:156:29
     payload: { userName },
 });
 
-export const replaceState = (state: AppState): AppStateAction => ({
-    type: AppActions.REPLACE_STATE,
-    payload: { state },
-});
+export const replaceState = () => undefined;
 
 export const loadState = (): LoadStateAction => ({
killedBy: gameReducer sets state from REPLACE_STATE action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ObjectLiteral
store/ducks/game/game.ts:158:14
 
 export const replaceState = (state: AppState): AppStateAction => ({
     type: AppActions.REPLACE_STATE,
-    payload: { state },
+    payload: {},
 });
 
killedBy: gameReducer sets state from REPLACE_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 0

@@ -31,10 +31,9 @@
    "event": "g-o-l/game/REPLACE_STATE",
    "fieldHeight": 5,

[Killed] ArrowFunction
store/ducks/game/game.ts:161:26
     payload: { state },
 });
 
-export const loadState = (): LoadStateAction => ({
-    type: AppActions.LOAD_STATE,
-});
+export const loadState = () => undefined;
 
 export const saveState = (state: AppState): SaveStateAction => ({
killedBy: gameReducer gameReducer-parameterized sets .userName from LOAD_STATE action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ObjectLiteral
store/ducks/game/game.ts:161:50
     payload: { state },
 });
 
-export const loadState = (): LoadStateAction => ({
-    type: AppActions.LOAD_STATE,
-});
+export const loadState = (): LoadStateAction => ({});
 
 export const saveState = (state: AppState): SaveStateAction => ({
killedBy: gameReducer gameReducer-parameterized sets .userName from LOAD_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/LOAD_STATE"
Received: "g-o-l/game/DEFAULT"

[Killed] ArrowFunction
store/ducks/game/game.ts:165:26
     type: AppActions.LOAD_STATE,
 });
 
-export const saveState = (state: AppState): SaveStateAction => ({
-    type: AppActions.SAVE_STATE,
-    payload: { state },
-});
+export const saveState = () => undefined;
 
 export const ioError = (errorInfo: string): IOErrorAction => ({
killedBy: gameReducer gameReducer-parameterized sets .userName from SAVE_STATE action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ArrowFunction
store/ducks/game/game.ts:170:24
     payload: { state },
 });
 
-export const ioError = (errorInfo: string): IOErrorAction => ({
-    type: AppActions.IO_ERROR,
-    payload: { errorInfo },
-});
+export const ioError = () => undefined;
 
 export const generation = (): GenerationAction => ({
killedBy: gameReducer gameReducer-parameterized sets .userName from IO_ERROR action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ObjectLiteral
store/ducks/game/game.ts:172:14
 
 export const ioError = (errorInfo: string): IOErrorAction => ({
     type: AppActions.IO_ERROR,
-    payload: { errorInfo },
+    payload: {},
 });
 
killedBy: gameReducer gameReducer-parameterized sets .userName from IO_ERROR action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Concrete digital TCP"
Received: undefined

[Killed] ArrowFunction
store/ducks/game/game.ts:175:27
     payload: { errorInfo },
 });
 
-export const generation = (): GenerationAction => ({
-    type: AppActions.GENERATION,
-});
+export const generation = () => undefined;
 
 export const mode = (mode: Mode): ModeAction => ({
killedBy: gameReducer gameReducer-parameterized sets .data from GENERATION action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ArrowFunction
store/ducks/game/game.ts:179:21
     type: AppActions.GENERATION,
 });
 
-export const mode = (mode: Mode): ModeAction => ({
-    type: AppActions.MODE,
-    payload: { mode },
-});
+export const mode = () => undefined;
 
 export const setMode = (mode: Mode): SetModeAction => ({
killedBy: gameReducer gameReducer-parameterized sets .mode from MODE action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ArrowFunction
store/ducks/game/game.ts:184:24
     payload: { mode },
 });
 
-export const setMode = (mode: Mode): SetModeAction => ({
-    type: AppActions.SET_MODE,
-    payload: { mode },
-});
+export const setMode = () => undefined;
 
 export const setSpeed = (speed: Speed): SetSpeedAction => ({
killedBy: game.saga watchPlaySaga
statusReason: Error: put(action): argument action is undefined

[Survived] ObjectLiteral
store/ducks/game/game.ts:186:14
 
 export const setMode = (mode: Mode): SetModeAction => ({
     type: AppActions.SET_MODE,
-    payload: { mode },
+    payload: {},
 });
 

[Killed] ArrowFunction
store/ducks/game/game.ts:189:25
     payload: { mode },
 });
 
-export const setSpeed = (speed: Speed): SetSpeedAction => ({
-    type: AppActions.SET_SPEED,
-    payload: { speed },
-});
+export const setSpeed = () => undefined;
 
 export const setCounter = (counter: number): SetCounterAction => ({
killedBy: gameReducer gameReducer-parameterized sets .speed from SET_SPEED action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] ObjectLiteral
store/ducks/game/game.ts:189:60
     payload: { mode },
 });
 
-export const setSpeed = (speed: Speed): SetSpeedAction => ({
-    type: AppActions.SET_SPEED,
-    payload: { speed },
-});
+export const setSpeed = (speed: Speed): SetSpeedAction => ({});
 
 export const setCounter = (counter: number): SetCounterAction => ({
killedBy: gameReducer gameReducer-parameterized sets .speed from SET_SPEED action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/SET_SPEED"
Received: "g-o-l/game/DEFAULT"

[Killed] ObjectLiteral
store/ducks/game/game.ts:191:14
 
 export const setSpeed = (speed: Speed): SetSpeedAction => ({
     type: AppActions.SET_SPEED,
-    payload: { speed },
+    payload: {},
 });
 
killedBy: gameReducer gameReducer-parameterized sets .speed from SET_SPEED action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "FAST"
Received: undefined

[Killed] ArrowFunction
store/ducks/game/game.ts:194:27
     payload: { speed },
 });
 
-export const setCounter = (counter: number): SetCounterAction => ({
-    type: AppActions.SET_COUNTER,
-    payload: { counter },
-});
+export const setCounter = () => undefined;
 
 export type AppAction =
killedBy: gameReducer gameReducer-parameterized sets .counter from SET_COUNTER action
statusReason: TypeError: Cannot read property 'type' of undefined

[Killed] BlockStatement
store/ducks/game/game.ts:223:37
     action: AppAction
 ): AppState {
     switch (action.type) {
-        case AppActions.FIELD_SIZE: {
-            let sizePair: SizePair = sizeToWH[action.payload.size];
-            let sizeName: Size = action.payload.size;
-            if (typeof sizePair === 'undefined') {
-                sizePair = sizeToWH[Size.SMALL];
-                sizeName = Size.SMALL;
-            }
-            return {
-                ...state,
-                event: AppActions.FIELD_SIZE,
-                fieldWidth: sizePair.w,
-                fieldHeight: sizePair.h,
-                size: sizeName,
-                data: recreateData(
-                    state.data,
-                    state.fieldWidth,
-                    state.fieldHeight,
-                    sizePair.w,
-                    sizePair.h
-                ),
-            };
-        }
+        case AppActions.FIELD_SIZE: {}
         case AppActions.INVERT: {
             const newData = state.data.concat();
killedBy: gameReducer gameReducer-parameterized sets .fieldWidth from FIELD_SIZE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/FIELD_SIZE"
Received: "g-o-l/game/INVERT"

[Killed] ConditionalExpression
store/ducks/game/game.ts:223:9
     action: AppAction
 ): AppState {
     switch (action.type) {
-        case AppActions.FIELD_SIZE: {
-            let sizePair: SizePair = sizeToWH[action.payload.size];
-            let sizeName: Size = action.payload.size;
-            if (typeof sizePair === 'undefined') {
-                sizePair = sizeToWH[Size.SMALL];
-                sizeName = Size.SMALL;
-            }
-            return {
-                ...state,
-                event: AppActions.FIELD_SIZE,
-                fieldWidth: sizePair.w,
-                fieldHeight: sizePair.h,
-                size: sizeName,
-                data: recreateData(
-                    state.data,
-                    state.fieldWidth,
-                    state.fieldHeight,
-                    sizePair.w,
-                    sizePair.h
-                ),
-            };
-        }
+        case AppActions.FIELD_SIZE:
         case AppActions.INVERT: {
             const newData = state.data.concat();
killedBy: gameReducer gameReducer-parameterized sets .fieldWidth from FIELD_SIZE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/FIELD_SIZE"
Received: "g-o-l/game/INVERT"

[Killed] EqualityOperator
store/ducks/game/game.ts:226:17
         case AppActions.FIELD_SIZE: {
             let sizePair: SizePair = sizeToWH[action.payload.size];
             let sizeName: Size = action.payload.size;
-            if (typeof sizePair === 'undefined') {
+            if (typeof sizePair !== 'undefined') {
                 sizePair = sizeToWH[Size.SMALL];
                 sizeName = Size.SMALL;
killedBy: gameReducer gameReducer-parameterized sets .fieldWidth from FIELD_SIZE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 10
Received: 5

[Killed] ConditionalExpression
store/ducks/game/game.ts:226:17
         case AppActions.FIELD_SIZE: {
             let sizePair: SizePair = sizeToWH[action.payload.size];
             let sizeName: Size = action.payload.size;
-            if (typeof sizePair === 'undefined') {
+            if (false) {
                 sizePair = sizeToWH[Size.SMALL];
                 sizeName = Size.SMALL;
killedBy: gameReducer gameReducer-parameterized sets .size=SMALL from badFieldSize
statusReason: TypeError: Cannot read property 'w' of undefined

[Killed] BlockStatement
store/ducks/game/game.ts:245:33
                 ),
             };
         }
-        case AppActions.INVERT: {
-            const newData = state.data.concat();
-            newData[action.payload.cellId] =
-                newData[action.payload.cellId] === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
-            return {
-                ...state,
-                event: AppActions.INVERT,
-                data: newData,
-            };
-        }
+        case AppActions.INVERT: {}
         case AppActions.FILL_PERCENT: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .event from INVERT action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/INVERT"
Received: "g-o-l/game/FILL_PERCENT"

[Killed] ConditionalExpression
store/ducks/game/game.ts:245:9
                 ),
             };
         }
-        case AppActions.INVERT: {
-            const newData = state.data.concat();
-            newData[action.payload.cellId] =
-                newData[action.payload.cellId] === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
-            return {
-                ...state,
-                event: AppActions.INVERT,
-                data: newData,
-            };
-        }
+        case AppActions.INVERT:
         case AppActions.FILL_PERCENT: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .event from INVERT action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/INVERT"
Received: "g-o-l/game/FILL_PERCENT"

[Killed] ConditionalExpression
store/ducks/game/game.ts:248:17
         case AppActions.INVERT: {
             const newData = state.data.concat();
             newData[action.payload.cellId] =
-                newData[action.payload.cellId] === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
+                false ? CellInfo.dead : CellInfo.alive;
             return {
                 ...state,
killedBy: gameReducer inverts .visible of item(num) from INVERT action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
store/ducks/game/game.ts:248:17
         case AppActions.INVERT: {
             const newData = state.data.concat();
             newData[action.payload.cellId] =
-                newData[action.payload.cellId] === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
+                newData[action.payload.cellId] !== CellInfo.alive ? CellInfo.dead : CellInfo.alive;
             return {
                 ...state,
killedBy: gameReducer inverts .visible of item(num) from INVERT action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
store/ducks/game/game.ts:255:39
                 data: newData,
             };
         }
-        case AppActions.FILL_PERCENT: {
-            return {
-                ...state,
-                event: AppActions.FILL_PERCENT,
-                fillPercent: action.payload.fillPercent,
-                data: randomFill(
-                    { width: state.fieldWidth, height: state.fieldHeight, data: state.data },
-                    fillPercentToProbability[action.payload.fillPercent]
-                ).data,
-            };
-        }
+        case AppActions.FILL_PERCENT: {}
         case AppActions.USER: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .fillPercent from FILL_PERCENT action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/FILL_PERCENT"
Received: "g-o-l/game/USER"

[Killed] ConditionalExpression
store/ducks/game/game.ts:255:9
                 data: newData,
             };
         }
-        case AppActions.FILL_PERCENT: {
-            return {
-                ...state,
-                event: AppActions.FILL_PERCENT,
-                fillPercent: action.payload.fillPercent,
-                data: randomFill(
-                    { width: state.fieldWidth, height: state.fieldHeight, data: state.data },
-                    fillPercentToProbability[action.payload.fillPercent]
-                ).data,
-            };
-        }
+        case AppActions.FILL_PERCENT:
         case AppActions.USER: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .fillPercent from FILL_PERCENT action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/FILL_PERCENT"
Received: "g-o-l/game/USER"

[Killed] ConditionalExpression
store/ducks/game/game.ts:266:9
                 ).data,
             };
         }
-        case AppActions.USER: {
-            return {
-                ...state,
-                event: AppActions.USER,
-                userName: action.payload.userName,
-            };
-        }
+        case AppActions.USER:
         case AppActions.REPLACE_STATE: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .userName from USER action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/USER"
Received: "g-o-l/game/REPLACE_STATE"

[Killed] BlockStatement
store/ducks/game/game.ts:266:31
                 ).data,
             };
         }
-        case AppActions.USER: {
-            return {
-                ...state,
-                event: AppActions.USER,
-                userName: action.payload.userName,
-            };
-        }
+        case AppActions.USER: {}
         case AppActions.REPLACE_STATE: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .userName from USER action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/USER"
Received: "g-o-l/game/REPLACE_STATE"

[Killed] BlockStatement
store/ducks/game/game.ts:273:40
                 userName: action.payload.userName,
             };
         }
-        case AppActions.REPLACE_STATE: {
-            return {
-                ...state,
-                ...action.payload.state,
-                event: AppActions.REPLACE_STATE,
-            };
-        }
+        case AppActions.REPLACE_STATE: {}
         case AppActions.LOAD_STATE: {
             return {
killedBy: gameReducer sets state from REPLACE_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/REPLACE_STATE"
Received: "g-o-l/game/LOAD_STATE"

[Killed] ConditionalExpression
store/ducks/game/game.ts:273:9
                 userName: action.payload.userName,
             };
         }
-        case AppActions.REPLACE_STATE: {
-            return {
-                ...state,
-                ...action.payload.state,
-                event: AppActions.REPLACE_STATE,
-            };
-        }
+        case AppActions.REPLACE_STATE:
         case AppActions.LOAD_STATE: {
             return {
killedBy: gameReducer sets state from REPLACE_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/REPLACE_STATE"
Received: "g-o-l/game/LOAD_STATE"

[Killed] ObjectLiteral
store/ducks/game/game.ts:274:20
             };
         }
         case AppActions.REPLACE_STATE: {
-            return {
-                ...state,
-                ...action.payload.state,
-                event: AppActions.REPLACE_STATE,
-            };
+            return {};
         }
         case AppActions.LOAD_STATE: {
killedBy: gameReducer sets state from REPLACE_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/REPLACE_STATE"
Received: undefined

[Killed] BlockStatement
store/ducks/game/game.ts:280:37
                 event: AppActions.REPLACE_STATE,
             };
         }
-        case AppActions.LOAD_STATE: {
-            return {
-                ...state,
-                event: AppActions.LOAD_STATE,
-            };
-        }
+        case AppActions.LOAD_STATE: {}
         case AppActions.SAVE_STATE: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .userName from LOAD_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/LOAD_STATE"
Received: "g-o-l/game/SAVE_STATE"

[Killed] ConditionalExpression
store/ducks/game/game.ts:280:9
                 event: AppActions.REPLACE_STATE,
             };
         }
-        case AppActions.LOAD_STATE: {
-            return {
-                ...state,
-                event: AppActions.LOAD_STATE,
-            };
-        }
+        case AppActions.LOAD_STATE:
         case AppActions.SAVE_STATE: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .userName from LOAD_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/LOAD_STATE"
Received: "g-o-l/game/SAVE_STATE"

[Killed] ConditionalExpression
store/ducks/game/game.ts:286:9
                 event: AppActions.LOAD_STATE,
             };
         }
-        case AppActions.SAVE_STATE: {
-            return {
-                ...state,
-                event: AppActions.SAVE_STATE,
-            };
-        }
+        case AppActions.SAVE_STATE:
         case AppActions.IO_ERROR: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .userName from SAVE_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/SAVE_STATE"
Received: "g-o-l/game/IO_ERROR"

[Killed] BlockStatement
store/ducks/game/game.ts:286:37
                 event: AppActions.LOAD_STATE,
             };
         }
-        case AppActions.SAVE_STATE: {
-            return {
-                ...state,
-                event: AppActions.SAVE_STATE,
-            };
-        }
+        case AppActions.SAVE_STATE: {}
         case AppActions.IO_ERROR: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .userName from SAVE_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/SAVE_STATE"
Received: "g-o-l/game/IO_ERROR"

[Killed] ObjectLiteral
store/ducks/game/game.ts:287:20
             };
         }
         case AppActions.SAVE_STATE: {
-            return {
-                ...state,
-                event: AppActions.SAVE_STATE,
-            };
+            return {};
         }
         case AppActions.IO_ERROR: {
killedBy: gameReducer gameReducer-parameterized sets .userName from SAVE_STATE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/SAVE_STATE"
Received: undefined

[Killed] BlockStatement
store/ducks/game/game.ts:292:35
                 event: AppActions.SAVE_STATE,
             };
         }
-        case AppActions.IO_ERROR: {
-            return {
-                ...state,
-                event: AppActions.IO_ERROR,
-                errorInfo: action.payload.errorInfo,
-            };
-        }
+        case AppActions.IO_ERROR: {}
         case AppActions.GENERATION: {
             const nextData = getNewField(
killedBy: gameReducer gameReducer-parameterized sets .userName from IO_ERROR action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/IO_ERROR"
Received: "g-o-l/game/GENERATION"

[Killed] ConditionalExpression
store/ducks/game/game.ts:292:9
                 event: AppActions.SAVE_STATE,
             };
         }
-        case AppActions.IO_ERROR: {
-            return {
-                ...state,
-                event: AppActions.IO_ERROR,
-                errorInfo: action.payload.errorInfo,
-            };
-        }
+        case AppActions.IO_ERROR:
         case AppActions.GENERATION: {
             const nextData = getNewField(
killedBy: gameReducer gameReducer-parameterized sets .userName from IO_ERROR action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/IO_ERROR"
Received: "g-o-l/game/GENERATION"

[Killed] ConditionalExpression
store/ducks/game/game.ts:299:9
                 errorInfo: action.payload.errorInfo,
             };
         }
-        case AppActions.GENERATION: {
-            const nextData = getNewField(
-                {
-                    data: state.data,
-                    width: state.fieldWidth,
-                    height: state.fieldHeight,
-                },
-                getGOLCellState
-            );
-
-            return {
-                ...state,
-                event: AppActions.GENERATION,
-                data: nextData.data,
-            };
-        }
+        case AppActions.GENERATION:
         case AppActions.MODE: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .data from GENERATION action
statusReason: TypeError: Cannot read property 'mode' of undefined

[Killed] BlockStatement
store/ducks/game/game.ts:299:37
                 errorInfo: action.payload.errorInfo,
             };
         }
-        case AppActions.GENERATION: {
-            const nextData = getNewField(
-                {
-                    data: state.data,
-                    width: state.fieldWidth,
-                    height: state.fieldHeight,
-                },
-                getGOLCellState
-            );
-
-            return {
-                ...state,
-                event: AppActions.GENERATION,
-                data: nextData.data,
-            };
-        }
+        case AppActions.GENERATION: {}
         case AppActions.MODE: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .data from GENERATION action
statusReason: TypeError: Cannot read property 'mode' of undefined

[Killed] BlockStatement
store/ducks/game/game.ts:315:31
                 data: nextData.data,
             };
         }
-        case AppActions.MODE: {
-            return {
-                ...state,
-                event: AppActions.MODE,
-                mode: action.payload.mode,
-            };
-        }
+        case AppActions.MODE: {}
         case AppActions.SET_SPEED: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .mode from MODE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/MODE"
Received: "g-o-l/game/SET_SPEED"

[Killed] ConditionalExpression
store/ducks/game/game.ts:315:9
                 data: nextData.data,
             };
         }
-        case AppActions.MODE: {
-            return {
-                ...state,
-                event: AppActions.MODE,
-                mode: action.payload.mode,
-            };
-        }
+        case AppActions.MODE:
         case AppActions.SET_SPEED: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .mode from MODE action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/MODE"
Received: "g-o-l/game/SET_SPEED"

[Killed] ConditionalExpression
store/ducks/game/game.ts:322:9
                 mode: action.payload.mode,
             };
         }
-        case AppActions.SET_SPEED: {
-            return {
-                ...state,
-                event: AppActions.SET_SPEED,
-                speed: action.payload.speed,
-            };
-        }
+        case AppActions.SET_SPEED:
         case AppActions.SET_COUNTER: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .speed from SET_SPEED action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/SET_SPEED"
Received: "g-o-l/game/SET_COUNTER"
