[Killed] BlockStatement
store/ducks/game/game.ts:322:36
                 mode: action.payload.mode,
             };
         }
-        case AppActions.SET_SPEED: {
-            return {
-                ...state,
-                event: AppActions.SET_SPEED,
-                speed: action.payload.speed,
-            };
-        }
+        case AppActions.SET_SPEED: {}
         case AppActions.SET_COUNTER: {
             return {
killedBy: gameReducer gameReducer-parameterized sets .speed from SET_SPEED action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/SET_SPEED"
Received: "g-o-l/game/SET_COUNTER"

[Killed] BlockStatement
store/ducks/game/game.ts:329:38
                 speed: action.payload.speed,
             };
         }
-        case AppActions.SET_COUNTER: {
-            return {
-                ...state,
-                event: AppActions.SET_COUNTER,
-                counter: action.payload.counter,
-            };
-        }
+        case AppActions.SET_COUNTER: {}
     }
     return state;
killedBy: gameReducer gameReducer-parameterized sets .counter from SET_COUNTER action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/SET_COUNTER"
Received: "g-o-l/game/DEFAULT"

[Killed] ConditionalExpression
store/ducks/game/game.ts:329:9
                 speed: action.payload.speed,
             };
         }
-        case AppActions.SET_COUNTER: {
-            return {
-                ...state,
-                event: AppActions.SET_COUNTER,
-                counter: action.payload.counter,
-            };
-        }
+        case AppActions.SET_COUNTER:
     }
     return state;
killedBy: gameReducer gameReducer-parameterized sets .counter from SET_COUNTER action
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "g-o-l/game/SET_COUNTER"
Received: "g-o-l/game/DEFAULT"
