[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:5:25
 import { CellArray, CellInfo } from '@src/types';
 
 export function createData(width: number, height: number): CellInfo[] {
-    const cellsNumber = width * height;
+    const cellsNumber = width / height;
     const newData: CellInfo[] = [];
     for (let i = 0; i < cellsNumber; i++) {
killedBy: createData It creates array of size=25 from 5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: 1

[Killed] ArrayDeclaration
store/ducks/game/playFieldUtils.ts:6:33
 
 export function createData(width: number, height: number): CellInfo[] {
     const cellsNumber = width * height;
-    const newData: CellInfo[] = [];
+    const newData: CellInfo[] = ["Stryker was here"];
     for (let i = 0; i < cellsNumber; i++) {
         newData.push(DEFAULT_CELL_STATE);
killedBy: createData It creates array of size=25 from 5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: 26

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:7:43
 export function createData(width: number, height: number): CellInfo[] {
     const cellsNumber = width * height;
     const newData: CellInfo[] = [];
-    for (let i = 0; i < cellsNumber; i++) {
-        newData.push(DEFAULT_CELL_STATE);
-    }
+    for (let i = 0; i < cellsNumber; i++) {}
     return newData;
 }
killedBy: createData It creates array of size=25 from 5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: 0

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:7:21
 export function createData(width: number, height: number): CellInfo[] {
     const cellsNumber = width * height;
     const newData: CellInfo[] = [];
-    for (let i = 0; i < cellsNumber; i++) {
+    for (let i = 0; false; i++) {
         newData.push(DEFAULT_CELL_STATE);
     }
killedBy: createData It creates array of size=25 from 5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: 0

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:19:15
     oldHeight: number,
     width: number,
     height: number
-): CellInfo[] {
-    const cellsNumber = width * height;
-    const newData: CellInfo[] = [];
-    for (let i = 0; i < cellsNumber; i++) {
-        newData.push(DEFAULT_CELL_STATE);
-    }
-
-    const minWidth = oldWidth < width ? oldWidth : width;
-    const minHeight = oldHeight < height ? oldHeight : height;
-
-    for (let y = 0; y < minHeight; y++) {
-        for (let x = 0; x < minWidth; x++) {
-            const visibleVal = oldData[yx(y, x, oldWidth)];
-            newData[yx(y, x, width)] = visibleVal;
-        }
-    }
-    return newData;
-}
+): CellInfo[] {}
 
 export const yx = (y: number, x: number, width: number) => y * width + x;
killedBy: recreateData It creates array of size=25 from source=3x3 and size=5x5
statusReason: TypeError: Cannot read property 'length' of undefined

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:20:25
     width: number,
     height: number
 ): CellInfo[] {
-    const cellsNumber = width * height;
+    const cellsNumber = width / height;
     const newData: CellInfo[] = [];
     for (let i = 0; i < cellsNumber; i++) {
killedBy: recreateData It creates array of size=25 from source=3x3 and size=5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: 13

[Survived] EqualityOperator
store/ducks/game/playFieldUtils.ts:26:22
         newData.push(DEFAULT_CELL_STATE);
     }
 
-    const minWidth = oldWidth < width ? oldWidth : width;
+    const minWidth = oldWidth >= width ? oldWidth : width;
     const minHeight = oldHeight < height ? oldHeight : height;
 

[Survived] EqualityOperator
store/ducks/game/playFieldUtils.ts:26:22
         newData.push(DEFAULT_CELL_STATE);
     }
 
-    const minWidth = oldWidth < width ? oldWidth : width;
+    const minWidth = oldWidth <= width ? oldWidth : width;
     const minHeight = oldHeight < height ? oldHeight : height;
 

[Survived] ConditionalExpression
store/ducks/game/playFieldUtils.ts:27:23
     }
 
     const minWidth = oldWidth < width ? oldWidth : width;
-    const minHeight = oldHeight < height ? oldHeight : height;
+    const minHeight = false ? oldHeight : height;
 
     for (let y = 0; y < minHeight; y++) {

[Survived] ConditionalExpression
store/ducks/game/playFieldUtils.ts:27:23
     }
 
     const minWidth = oldWidth < width ? oldWidth : width;
-    const minHeight = oldHeight < height ? oldHeight : height;
+    const minHeight = true ? oldHeight : height;
 
     for (let y = 0; y < minHeight; y++) {

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:29:21
     const minWidth = oldWidth < width ? oldWidth : width;
     const minHeight = oldHeight < height ? oldHeight : height;
 
-    for (let y = 0; y < minHeight; y++) {
+    for (let y = 0; y >= minHeight; y++) {
         for (let x = 0; x < minWidth; x++) {
             const visibleVal = oldData[yx(y, x, oldWidth)];
killedBy: recreateData It uses data of source array 3x3 when constructs 5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(0,0) 1"
Received: "(0,0) 0"

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:29:41
     const minWidth = oldWidth < width ? oldWidth : width;
     const minHeight = oldHeight < height ? oldHeight : height;
 
-    for (let y = 0; y < minHeight; y++) {
-        for (let x = 0; x < minWidth; x++) {
-            const visibleVal = oldData[yx(y, x, oldWidth)];
-            newData[yx(y, x, width)] = visibleVal;
-        }
-    }
+    for (let y = 0; y < minHeight; y++) {}
     return newData;
 }
killedBy: recreateData It uses data of source array 3x3 when constructs 5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(1,2) 1"
Received: "(1,2) 0"

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:30:44
     const minHeight = oldHeight < height ? oldHeight : height;
 
     for (let y = 0; y < minHeight; y++) {
-        for (let x = 0; x < minWidth; x++) {
-            const visibleVal = oldData[yx(y, x, oldWidth)];
-            newData[yx(y, x, width)] = visibleVal;
-        }
+        for (let x = 0; x < minWidth; x++) {}
     }
     return newData;
killedBy: recreateData It uses data of source array 3x3 when constructs 5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(0,0) 1"
Received: "(0,0) 0"

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:30:25
     const minHeight = oldHeight < height ? oldHeight : height;
 
     for (let y = 0; y < minHeight; y++) {
-        for (let x = 0; x < minWidth; x++) {
+        for (let x = 0; x >= minWidth; x++) {
             const visibleVal = oldData[yx(y, x, oldWidth)];
             newData[yx(y, x, width)] = visibleVal;
killedBy: recreateData It uses data of source array 3x3 when constructs 5x5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "(0,2) 1"
Received: "(0,2) 0"

[Killed] ArrowFunction
store/ducks/game/playFieldUtils.ts:38:19
     return newData;
 }
 
-export const yx = (y: number, x: number, width: number) => y * width + x;
+export const yx = () => undefined;
 
 export const randomFill = (srcAr: CellArray, probability: number): CellArray => {
killedBy: getNewField converts all cells from alive into dead
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Object {
    "data": Array [
-     1,

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:38:60
     return newData;
 }
 
-export const yx = (y: number, x: number, width: number) => y * width + x;
+export const yx = (y: number, x: number, width: number) => y / width + x;
 
 export const randomFill = (srcAr: CellArray, probability: number): CellArray => {
killedBy: getNewField converts all cells from alive into dead
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Object {
    "data": Array [
      1,

[Killed] LogicalOperator
store/ducks/game/playFieldUtils.ts:41:9
 export const yx = (y: number, x: number, width: number) => y * width + x;
 
 export const randomFill = (srcAr: CellArray, probability: number): CellArray => {
-    if (probability < 0 || probability > 1) {
+    if (probability < 0 && probability > 1) {
         throw new Error('Probability must be between 0 and 1');
     }
killedBy: randomFill throws if probability <0
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:41:28
 export const yx = (y: number, x: number, width: number) => y * width + x;
 
 export const randomFill = (srcAr: CellArray, probability: number): CellArray => {
-    if (probability < 0 || probability > 1) {
+    if (probability < 0 || false) {
         throw new Error('Probability must be between 0 and 1');
     }
killedBy: randomFill throws if probability >1
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:50:24
         data: createData(srcAr.width, srcAr.height),
     };
 
-    const totalCells = ar.width * ar.height;
+    const totalCells = ar.width / ar.height;
     let unprocessedCells = totalCells;
     let restAliveCells = Math.floor(unprocessedCells * probability);
killedBy: gameReducer randomizes .data from FILL_PERCENT-25% action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:52:37
 
     const totalCells = ar.width * ar.height;
     let unprocessedCells = totalCells;
-    let restAliveCells = Math.floor(unprocessedCells * probability);
+    let restAliveCells = Math.floor(unprocessedCells / probability);
     for (let i = 0; i < totalCells; i++) {
         let alive = CellInfo.dead;
killedBy: randomFill insert alive cells into array from probability 25%
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 20

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:53:21
     const totalCells = ar.width * ar.height;
     let unprocessedCells = totalCells;
     let restAliveCells = Math.floor(unprocessedCells * probability);
-    for (let i = 0; i < totalCells; i++) {
+    for (let i = 0; false; i++) {
         let alive = CellInfo.dead;
         if (restAliveCells > 0 && restAliveCells / unprocessedCells > Math.random()) {
killedBy: gameReducer randomizes .data from FILL_PERCENT-25% action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:53:21
     const totalCells = ar.width * ar.height;
     let unprocessedCells = totalCells;
     let restAliveCells = Math.floor(unprocessedCells * probability);
-    for (let i = 0; i < totalCells; i++) {
+    for (let i = 0; i >= totalCells; i++) {
         let alive = CellInfo.dead;
         if (restAliveCells > 0 && restAliveCells / unprocessedCells > Math.random()) {
killedBy: gameReducer randomizes .data from FILL_PERCENT-25% action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:55:13
     let restAliveCells = Math.floor(unprocessedCells * probability);
     for (let i = 0; i < totalCells; i++) {
         let alive = CellInfo.dead;
-        if (restAliveCells > 0 && restAliveCells / unprocessedCells > Math.random()) {
+        if (restAliveCells <= 0 && restAliveCells / unprocessedCells > Math.random()) {
             alive = CellInfo.alive;
             restAliveCells--;
killedBy: gameReducer randomizes .data from FILL_PERCENT-25% action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:55:35
     let restAliveCells = Math.floor(unprocessedCells * probability);
     for (let i = 0; i < totalCells; i++) {
         let alive = CellInfo.dead;
-        if (restAliveCells > 0 && restAliveCells / unprocessedCells > Math.random()) {
+        if (restAliveCells > 0 && restAliveCells / unprocessedCells <= Math.random()) {
             alive = CellInfo.alive;
             restAliveCells--;
killedBy: gameReducer randomizes .data from FILL_PERCENT-50% action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 8

[Killed] UpdateOperator
store/ducks/game/playFieldUtils.ts:57:13
         let alive = CellInfo.dead;
         if (restAliveCells > 0 && restAliveCells / unprocessedCells > Math.random()) {
             alive = CellInfo.alive;
-            restAliveCells--;
+            restAliveCells++;
         }
         ar.data[i] = alive;
killedBy: gameReducer randomizes .data from FILL_PERCENT-25% action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 15

[Killed] UpdateOperator
store/ducks/game/playFieldUtils.ts:60:9
             restAliveCells--;
         }
         ar.data[i] = alive;
-        unprocessedCells--;
+        unprocessedCells++;
     }
 
killedBy: gameReducer randomizes .data from FILL_PERCENT-25% action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 3

[Killed] ArrowFunction
store/ducks/game/playFieldUtils.ts:66:28
     return ar;
 };
 
-export const getInverted = (cell: CellInfo): CellInfo =>
-    cell === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
+export const getInverted = () => undefined;
 
 export const getCicledX = (srcAr: CellArray, x: number): number => {
killedBy: gameReducer inverts .visible of item(num) from INVERT action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: 1

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:67:5
 };
 
 export const getInverted = (cell: CellInfo): CellInfo =>
-    cell === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
+    cell !== CellInfo.alive ? CellInfo.dead : CellInfo.alive;
 
 export const getCicledX = (srcAr: CellArray, x: number): number => {
killedBy: gameReducer inverts .visible of item(num) from INVERT action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:67:5
 };
 
 export const getInverted = (cell: CellInfo): CellInfo =>
-    cell === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
+    true ? CellInfo.dead : CellInfo.alive;
 
 export const getCicledX = (srcAr: CellArray, x: number): number => {
killedBy: gameReducer inverts .visible of item(num) from INVERT action
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:69:68
 export const getInverted = (cell: CellInfo): CellInfo =>
     cell === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
 
-export const getCicledX = (srcAr: CellArray, x: number): number => {
-    if (x >= 0) {
-        return x % srcAr.width;
-    }
-
-    return (x % srcAr.width) + srcAr.width;
-};
+export const getCicledX = (srcAr: CellArray, x: number): number => {};
 
 export const getCicledY = (srcAr: CellArray, y: number): number => {
killedBy: getCicledX returns x if (0 <= x <= width-1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 39628
Received: undefined

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:70:17
     cell === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
 
 export const getCicledX = (srcAr: CellArray, x: number): number => {
-    if (x >= 0) {
-        return x % srcAr.width;
-    }
+    if (x >= 0) {}
 
     return (x % srcAr.width) + srcAr.width;
killedBy: getCicledX returns x if (0 <= x <= width-1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 193
Received: 27648

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:70:9
     cell === CellInfo.alive ? CellInfo.dead : CellInfo.alive;
 
 export const getCicledX = (srcAr: CellArray, x: number): number => {
-    if (x >= 0) {
+    if (false) {
         return x % srcAr.width;
     }
killedBy: getCicledX returns x if (0 <= x <= width-1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2667
Received: 57491

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:71:16
 
 export const getCicledX = (srcAr: CellArray, x: number): number => {
     if (x >= 0) {
-        return x % srcAr.width;
+        return x * srcAr.width;
     }
 
killedBy: getCicledX returns x if (0 <= x <= width-1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 42932
Received: 4076221672

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:74:12
         return x % srcAr.width;
     }
 
-    return (x % srcAr.width) + srcAr.width;
+    return x % srcAr.width - srcAr.width;
 };
 
killedBy: getCicledX returns x+width if (-width <= x < 0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 72204
Received: -120380

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:74:13
         return x % srcAr.width;
     }
 
-    return (x % srcAr.width) + srcAr.width;
+    return (x * srcAr.width) + srcAr.width;
 };
 
killedBy: getCicledX returns x+width if (-width <= x < 0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25239
Received: -6969160500

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:77:68
     return (x % srcAr.width) + srcAr.width;
 };
 
-export const getCicledY = (srcAr: CellArray, y: number): number => {
-    if (y >= 0) {
-        return y % srcAr.height;
-    }
-
-    return (y % srcAr.height) + srcAr.height;
-};
+export const getCicledY = (srcAr: CellArray, y: number): number => {};
 
 //matrix of cells 3x3:
killedBy: getCicledY returns y if (0 <= y <= height-1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 19772
Received: undefined

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:78:9
 };
 
 export const getCicledY = (srcAr: CellArray, y: number): number => {
-    if (y >= 0) {
+    if (y < 0) {
         return y % srcAr.height;
     }
killedBy: getCicledY returns y if (0 <= y <= height-1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 7183
Received: 52524

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:78:9
 };
 
 export const getCicledY = (srcAr: CellArray, y: number): number => {
-    if (y >= 0) {
+    if (y > 0) {
         return y % srcAr.height;
     }
killedBy: getCicledY returns 0 from 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 82552

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:79:16
 
 export const getCicledY = (srcAr: CellArray, y: number): number => {
     if (y >= 0) {
-        return y % srcAr.height;
+        return y * srcAr.height;
     }
 
killedBy: getCicledY returns y if (0 <= y <= height-1)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 18536
Received: 1477856744

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:82:13
         return y % srcAr.height;
     }
 
-    return (y % srcAr.height) + srcAr.height;
+    return (y * srcAr.height) + srcAr.height;
 };
 
killedBy: getCicledY returns y+height if (-height <= y < 0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 32891
Received: -3269660085

[Killed] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:82:12
         return y % srcAr.height;
     }
 
-    return (y % srcAr.height) + srcAr.height;
+    return y % srcAr.height - srcAr.height;
 };
 
killedBy: getCicledY returns y+height if (-height <= y < 0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 11532
Received: -44036

[Killed] ArrowFunction
store/ducks/game/playFieldUtils.ts:100:53
     h: CellInfo,
     i: CellInfo
 ) => CellInfo;
-export const getInvertedCellState: CellCalculator = (
-    a: CellInfo,
-    b: CellInfo,
-    c: CellInfo,
-    d: CellInfo,
-    e: CellInfo,
-    f: CellInfo,
-    g: CellInfo,
-    h: CellInfo,
-    i: CellInfo
-) => (e === CellInfo.dead ? CellInfo.alive : CellInfo.dead);
+export const getInvertedCellState: CellCalculator = () => undefined;
 
 export const getNewField = (srcAr: CellArray, calculator: CellCalculator): CellArray => {
killedBy: getCicledX returns x+width if (-width <= x < 0)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 6

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:110:7
     g: CellInfo,
     h: CellInfo,
     i: CellInfo
-) => (e === CellInfo.dead ? CellInfo.alive : CellInfo.dead);
+) => (e !== CellInfo.dead ? CellInfo.alive : CellInfo.dead);
 
 export const getNewField = (srcAr: CellArray, calculator: CellCalculator): CellArray => {
killedBy: getInvertedCellState returns alive from dead
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:110:7
     g: CellInfo,
     h: CellInfo,
     i: CellInfo
-) => (e === CellInfo.dead ? CellInfo.alive : CellInfo.dead);
+) => (true ? CellInfo.alive : CellInfo.dead);
 
 export const getNewField = (srcAr: CellArray, calculator: CellCalculator): CellArray => {
killedBy: getInvertedCellState returns dead from alive
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:114:21
 
 export const getNewField = (srcAr: CellArray, calculator: CellCalculator): CellArray => {
     const newField = { ...srcAr, data: [...srcAr.data] };
-    for (let y = 0; y < srcAr.height; y++) {
+    for (let y = 0; y >= srcAr.height; y++) {
         for (let x = 0; x < srcAr.width; x++) {
             const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
killedBy: getNewField calls calculator
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:114:44
 
 export const getNewField = (srcAr: CellArray, calculator: CellCalculator): CellArray => {
     const newField = { ...srcAr, data: [...srcAr.data] };
-    for (let y = 0; y < srcAr.height; y++) {
-        for (let x = 0; x < srcAr.width; x++) {
-            const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
-            const b = newField.data[yx(y - 1, x, srcAr.width)];
-            const c = newField.data[yx(y - 1, x + 1, srcAr.width)];
-            const d = newField.data[yx(y, x - 1, srcAr.width)];
-            const e = newField.data[yx(y, x, srcAr.width)];
-            const f = newField.data[yx(y, x + 1, srcAr.width)];
-            const g = newField.data[yx(y + 1, x - 1, srcAr.width)];
-            const h = newField.data[yx(y + 1, x, srcAr.width)];
-            const i = newField.data[yx(y + 1, x + 1, srcAr.width)];
-            const newE = calculator(a, b, c, d, e, f, g, h, i);
-            newField.data[yx(y, x, srcAr.width)] = newE;
-        }
-    }
+    for (let y = 0; y < srcAr.height; y++) {}
     return newField;
 };
killedBy: getNewField calls calculator
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
store/ducks/game/playFieldUtils.ts:115:25
 export const getNewField = (srcAr: CellArray, calculator: CellCalculator): CellArray => {
     const newField = { ...srcAr, data: [...srcAr.data] };
     for (let y = 0; y < srcAr.height; y++) {
-        for (let x = 0; x < srcAr.width; x++) {
+        for (let x = 0; x >= srcAr.width; x++) {
             const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
             const b = newField.data[yx(y - 1, x, srcAr.width)];
killedBy: getNewField calls calculator
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:115:47
 export const getNewField = (srcAr: CellArray, calculator: CellCalculator): CellArray => {
     const newField = { ...srcAr, data: [...srcAr.data] };
     for (let y = 0; y < srcAr.height; y++) {
-        for (let x = 0; x < srcAr.width; x++) {
-            const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
-            const b = newField.data[yx(y - 1, x, srcAr.width)];
-            const c = newField.data[yx(y - 1, x + 1, srcAr.width)];
-            const d = newField.data[yx(y, x - 1, srcAr.width)];
-            const e = newField.data[yx(y, x, srcAr.width)];
-            const f = newField.data[yx(y, x + 1, srcAr.width)];
-            const g = newField.data[yx(y + 1, x - 1, srcAr.width)];
-            const h = newField.data[yx(y + 1, x, srcAr.width)];
-            const i = newField.data[yx(y + 1, x + 1, srcAr.width)];
-            const newE = calculator(a, b, c, d, e, f, g, h, i);
-            newField.data[yx(y, x, srcAr.width)] = newE;
-        }
+        for (let x = 0; x < srcAr.width; x++) {}
     }
     return newField;
killedBy: getNewField calls calculator
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:116:47
     const newField = { ...srcAr, data: [...srcAr.data] };
     for (let y = 0; y < srcAr.height; y++) {
         for (let x = 0; x < srcAr.width; x++) {
-            const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
+            const a = newField.data[yx(y - 1, x + 1, srcAr.width)];
             const b = newField.data[yx(y - 1, x, srcAr.width)];
             const c = newField.data[yx(y - 1, x + 1, srcAr.width)];

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:116:40
     const newField = { ...srcAr, data: [...srcAr.data] };
     for (let y = 0; y < srcAr.height; y++) {
         for (let x = 0; x < srcAr.width; x++) {
-            const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
+            const a = newField.data[yx(y + 1, x - 1, srcAr.width)];
             const b = newField.data[yx(y - 1, x, srcAr.width)];
             const c = newField.data[yx(y - 1, x + 1, srcAr.width)];

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:117:40
     for (let y = 0; y < srcAr.height; y++) {
         for (let x = 0; x < srcAr.width; x++) {
             const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
-            const b = newField.data[yx(y - 1, x, srcAr.width)];
+            const b = newField.data[yx(y + 1, x, srcAr.width)];
             const c = newField.data[yx(y - 1, x + 1, srcAr.width)];
             const d = newField.data[yx(y, x - 1, srcAr.width)];

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:118:47
         for (let x = 0; x < srcAr.width; x++) {
             const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
             const b = newField.data[yx(y - 1, x, srcAr.width)];
-            const c = newField.data[yx(y - 1, x + 1, srcAr.width)];
+            const c = newField.data[yx(y - 1, x - 1, srcAr.width)];
             const d = newField.data[yx(y, x - 1, srcAr.width)];
             const e = newField.data[yx(y, x, srcAr.width)];

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:118:40
         for (let x = 0; x < srcAr.width; x++) {
             const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
             const b = newField.data[yx(y - 1, x, srcAr.width)];
-            const c = newField.data[yx(y - 1, x + 1, srcAr.width)];
+            const c = newField.data[yx(y + 1, x + 1, srcAr.width)];
             const d = newField.data[yx(y, x - 1, srcAr.width)];
             const e = newField.data[yx(y, x, srcAr.width)];

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:119:43
             const a = newField.data[yx(y - 1, x - 1, srcAr.width)];
             const b = newField.data[yx(y - 1, x, srcAr.width)];
             const c = newField.data[yx(y - 1, x + 1, srcAr.width)];
-            const d = newField.data[yx(y, x - 1, srcAr.width)];
+            const d = newField.data[yx(y, x + 1, srcAr.width)];
             const e = newField.data[yx(y, x, srcAr.width)];
             const f = newField.data[yx(y, x + 1, srcAr.width)];

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:121:43
             const c = newField.data[yx(y - 1, x + 1, srcAr.width)];
             const d = newField.data[yx(y, x - 1, srcAr.width)];
             const e = newField.data[yx(y, x, srcAr.width)];
-            const f = newField.data[yx(y, x + 1, srcAr.width)];
+            const f = newField.data[yx(y, x - 1, srcAr.width)];
             const g = newField.data[yx(y + 1, x - 1, srcAr.width)];
             const h = newField.data[yx(y + 1, x, srcAr.width)];
