[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:122:40
             const d = newField.data[yx(y, x - 1, srcAr.width)];
             const e = newField.data[yx(y, x, srcAr.width)];
             const f = newField.data[yx(y, x + 1, srcAr.width)];
-            const g = newField.data[yx(y + 1, x - 1, srcAr.width)];
+            const g = newField.data[yx(y - 1, x - 1, srcAr.width)];
             const h = newField.data[yx(y + 1, x, srcAr.width)];
             const i = newField.data[yx(y + 1, x + 1, srcAr.width)];

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:122:47
             const d = newField.data[yx(y, x - 1, srcAr.width)];
             const e = newField.data[yx(y, x, srcAr.width)];
             const f = newField.data[yx(y, x + 1, srcAr.width)];
-            const g = newField.data[yx(y + 1, x - 1, srcAr.width)];
+            const g = newField.data[yx(y + 1, x + 1, srcAr.width)];
             const h = newField.data[yx(y + 1, x, srcAr.width)];
             const i = newField.data[yx(y + 1, x + 1, srcAr.width)];

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:123:40
             const e = newField.data[yx(y, x, srcAr.width)];
             const f = newField.data[yx(y, x + 1, srcAr.width)];
             const g = newField.data[yx(y + 1, x - 1, srcAr.width)];
-            const h = newField.data[yx(y + 1, x, srcAr.width)];
+            const h = newField.data[yx(y - 1, x, srcAr.width)];
             const i = newField.data[yx(y + 1, x + 1, srcAr.width)];
             const newE = calculator(a, b, c, d, e, f, g, h, i);

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:124:47
             const f = newField.data[yx(y, x + 1, srcAr.width)];
             const g = newField.data[yx(y + 1, x - 1, srcAr.width)];
             const h = newField.data[yx(y + 1, x, srcAr.width)];
-            const i = newField.data[yx(y + 1, x + 1, srcAr.width)];
+            const i = newField.data[yx(y + 1, x - 1, srcAr.width)];
             const newE = calculator(a, b, c, d, e, f, g, h, i);
             newField.data[yx(y, x, srcAr.width)] = newE;

[Survived] ArithmeticOperator
store/ducks/game/playFieldUtils.ts:124:40
             const f = newField.data[yx(y, x + 1, srcAr.width)];
             const g = newField.data[yx(y + 1, x - 1, srcAr.width)];
             const h = newField.data[yx(y + 1, x, srcAr.width)];
-            const i = newField.data[yx(y + 1, x + 1, srcAr.width)];
+            const i = newField.data[yx(y - 1, x + 1, srcAr.width)];
             const newE = calculator(a, b, c, d, e, f, g, h, i);
             newField.data[yx(y, x, srcAr.width)] = newE;

[Killed] BlockStatement
store/ducks/game/playFieldUtils.ts:142:6
     g: CellInfo,
     h: CellInfo,
     i: CellInfo
-) => {
-    const neighbors = [a, b, c, d, f, g, h, i];
-    const aliveNeighbors = neighbors.filter((cell: CellInfo) => cell === CellInfo.alive);
-    const cellToLive = aliveNeighbors.length === 3;
-    return cellToLive ? CellInfo.alive : CellInfo.dead;
-};
+) => {};
 
killedBy: getGOLCellState returns 0 (remains dead) from 000000000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:144:65
     i: CellInfo
 ) => {
     const neighbors = [a, b, c, d, f, g, h, i];
-    const aliveNeighbors = neighbors.filter((cell: CellInfo) => cell === CellInfo.alive);
+    const aliveNeighbors = neighbors.filter((cell: CellInfo) => false);
     const cellToLive = aliveNeighbors.length === 3;
     return cellToLive ? CellInfo.alive : CellInfo.dead;
killedBy: getGOLCellState returns 1 (births) from 111000000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:144:65
     i: CellInfo
 ) => {
     const neighbors = [a, b, c, d, f, g, h, i];
-    const aliveNeighbors = neighbors.filter((cell: CellInfo) => cell === CellInfo.alive);
+    const aliveNeighbors = neighbors.filter((cell: CellInfo) => true);
     const cellToLive = aliveNeighbors.length === 3;
     return cellToLive ? CellInfo.alive : CellInfo.dead;
killedBy: getGOLCellState returns 1 (births) from 111000000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:145:24
 ) => {
     const neighbors = [a, b, c, d, f, g, h, i];
     const aliveNeighbors = neighbors.filter((cell: CellInfo) => cell === CellInfo.alive);
-    const cellToLive = aliveNeighbors.length === 3;
+    const cellToLive = false;
     return cellToLive ? CellInfo.alive : CellInfo.dead;
 };
killedBy: getGOLCellState returns 1 (births) from 111000000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
store/ducks/game/playFieldUtils.ts:145:24
 ) => {
     const neighbors = [a, b, c, d, f, g, h, i];
     const aliveNeighbors = neighbors.filter((cell: CellInfo) => cell === CellInfo.alive);
-    const cellToLive = aliveNeighbors.length === 3;
+    const cellToLive = true;
     return cellToLive ? CellInfo.alive : CellInfo.dead;
 };
killedBy: getGOLCellState returns 0 (remains dead) from 000000000
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1
