[Survived] BlockStatement
game-of-life/src/store/hooks.ts:5:34
 import { RootState } from '@src/store';
 import { AppState } from './ducks/game';
 
-export const useAppState = () => {
-    const appState = useSelector<RootState, AppState>((st: RootState) => st.game);
-    return appState;
-};
+export const useAppState = () => {};
 

[Survived] ArrowFunction
game-of-life/src/store/hooks.ts:6:55
 import { AppState } from './ducks/game';
 
 export const useAppState = () => {
-    const appState = useSelector<RootState, AppState>((st: RootState) => st.game);
+    const appState = useSelector<RootState, AppState>(() => undefined);
     return appState;
 };
