[Killed] BlockStatement
src/store/sagas/rootSaga.ts:5:60
 import { all, AllEffect } from 'redux-saga/effects';
 import { watchPlaySaga } from '@src/store/ducks/game';
 
-export function* rootSaga(): Generator<AllEffect<unknown>> {
-    yield all([watchLoadStateSaga(), watchSaveStateSaga(), watchPlaySaga()]);
-}
+export function* rootSaga(): Generator<AllEffect<unknown>> {}
 
killedBy: rootSaga watches AppActions.LOAD_STATE, AppActions.SAVE_STATE
statusReason: SagaTestError: 
take expectation unmet:

Expected
--------
{
  '@@redux-saga/IO': true,
  combinator: false,
