[Killed] BlockStatement
src/testFramework/lib/reducer.ts:3:87
 import faker from 'faker';
 
-export const getFromState = (state: Record<string, any>, selector: string): string => {
-    if (selector.indexOf('.') === -1) {
-        return state[selector] as string;
-    }
-    const selectorAr = selector.split('.');
-    const lastSelectorItem = selectorAr.concat().pop() as string;
-    const domainName = selectorAr[0];
-    const stateDomain = state[domainName] as Record<string, string>;
-    return stateDomain[lastSelectorItem];
-};
+export const getFromState = (state: Record<string, any>, selector: string): string => {};
 
 export const getVal = (
killedBy: getFromState
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Cotton Avon"
Received: undefined

[Killed] ConditionalExpression
src/testFramework/lib/reducer.ts:4:9
 import faker from 'faker';
 
 export const getFromState = (state: Record<string, any>, selector: string): string => {
-    if (selector.indexOf('.') === -1) {
+    if (true) {
         return state[selector] as string;
     }
killedBy: getFromState
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Omani Car Jewelery"
Received: undefined

[Killed] UnaryOperator
src/testFramework/lib/reducer.ts:4:35
 import faker from 'faker';
 
 export const getFromState = (state: Record<string, any>, selector: string): string => {
-    if (selector.indexOf('.') === -1) {
+    if (selector.indexOf('.') === +1) {
         return state[selector] as string;
     }
killedBy: getFromState
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Associate"
Received: undefined

[Killed] BlockStatement
src/testFramework/lib/reducer.ts:17:6
 export const getVal = (
     actions: { payload: Record<string, string | Object> }[],
     value: number | string
-) => {
-    let val = value;
-    if (typeof value === 'string' && value.indexOf('.') !== -1) {
-        const selectorAr = value.split('.');
-        const lastSelectorItem = selectorAr.concat().pop() as string;
-        val = getFromState(actions[0].payload, lastSelectorItem);
-    }
-    return val;
-};
+) => {};
 
 export const num = () => faker.datatype.number();
killedBy: getVal
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: undefined

[Killed] BlockStatement
src/testFramework/lib/reducer.ts:19:65
     value: number | string
 ) => {
     let val = value;
-    if (typeof value === 'string' && value.indexOf('.') !== -1) {
-        const selectorAr = value.split('.');
-        const lastSelectorItem = selectorAr.concat().pop() as string;
-        val = getFromState(actions[0].payload, lastSelectorItem);
-    }
+    if (typeof value === 'string' && value.indexOf('.') !== -1) {}
     return val;
 };
killedBy: getVal
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "ssssc"
Received: "payload.fieldName"

[Killed] EqualityOperator
src/testFramework/lib/reducer.ts:19:9
     value: number | string
 ) => {
     let val = value;
-    if (typeof value === 'string' && value.indexOf('.') !== -1) {
+    if (typeof value !== 'string' && value.indexOf('.') !== -1) {
         const selectorAr = value.split('.');
         const lastSelectorItem = selectorAr.concat().pop() as string;
killedBy: getVal
statusReason: TypeError: value.indexOf is not a function

[Survived] ArrowFunction
src/testFramework/lib/reducer.ts:27:20
     return val;
 };
 
-export const num = () => faker.datatype.number();
+export const num = () => undefined;
 export const str = () => faker.random.words();
 export const bool = () => faker.datatype.boolean();

[Survived] ArrowFunction
src/testFramework/lib/reducer.ts:28:20
 };
 
 export const num = () => faker.datatype.number();
-export const str = () => faker.random.words();
+export const str = () => undefined;
 export const bool = () => faker.datatype.boolean();
 export const size = (maxSize: number) => Math.floor(maxSize * Math.random());

[Survived] ArrowFunction
src/testFramework/lib/reducer.ts:29:21
 
 export const num = () => faker.datatype.number();
 export const str = () => faker.random.words();
-export const bool = () => faker.datatype.boolean();
+export const bool = () => undefined;
 export const size = (maxSize: number) => Math.floor(maxSize * Math.random());
 

[Survived] ArithmeticOperator
src/testFramework/lib/reducer.ts:30:53
 export const num = () => faker.datatype.number();
 export const str = () => faker.random.words();
 export const bool = () => faker.datatype.boolean();
-export const size = (maxSize: number) => Math.floor(maxSize * Math.random());
+export const size = (maxSize: number) => Math.floor(maxSize / Math.random());
 

[Survived] ArrowFunction
src/testFramework/lib/reducer.ts:30:21
 export const num = () => faker.datatype.number();
 export const str = () => faker.random.words();
 export const bool = () => faker.datatype.boolean();
-export const size = (maxSize: number) => Math.floor(maxSize * Math.random());
+export const size = () => undefined;
 
