[Survived] ArrowFunction
src/testFramework/lib/store.ts:5:32
 import * as reducers from '@src/store/ducks';
 import thunkMiddleware from 'redux-thunk';
 const rootReducer = combineReducers(reducers);
-export const createMockStore = () =>
-    createStore(rootReducer, compose(applyMiddleware(thunkMiddleware)));
+export const createMockStore = () => undefined;
 
